/*
SQLyog Ultimate v12.09 (64 bit)
MySQL - 5.7.22-log : Database - xctcmsweb
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`xctcmsweb` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `xctcmsweb`;

/*Table structure for table `bank_led` */

DROP TABLE IF EXISTS `bank_led`;

CREATE TABLE `bank_led` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `ip` varchar(50) DEFAULT NULL,
  `width` varchar(50) DEFAULT NULL,
  `height` varchar(50) DEFAULT NULL,
  `text` varchar(255) DEFAULT NULL,
  `fontname` varchar(50) DEFAULT NULL,
  `fontcolor` varchar(50) DEFAULT NULL,
  `fontsize` varchar(50) DEFAULT NULL,
  `playspeed` varchar(50) DEFAULT NULL,
  `default_text` varchar(255) DEFAULT NULL,
  `response_code` varchar(50) DEFAULT NULL,
  `islink` varchar(50) DEFAULT NULL,
  `zu_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `bank_led` */

/*Table structure for table `led` */

DROP TABLE IF EXISTS `led`;

CREATE TABLE `led` (
  `id` int(11) NOT NULL,
  `pno` varchar(50) DEFAULT NULL,
  `title` varchar(50) DEFAULT NULL,
  `ip` varchar(50) DEFAULT NULL,
  `x` int(11) DEFAULT NULL,
  `y` int(11) DEFAULT NULL,
  `width` int(11) DEFAULT NULL,
  `height` int(11) DEFAULT NULL,
  `text` longtext,
  `fontName` varchar(50) DEFAULT NULL,
  `fontColor` int(11) DEFAULT NULL,
  `fontsize` int(11) DEFAULT NULL,
  `stunt` varchar(50) DEFAULT NULL,
  `playspeed` int(11) DEFAULT NULL,
  `bold` varchar(50) DEFAULT NULL,
  `italic` varchar(50) DEFAULT NULL,
  `underline` varchar(50) DEFAULT NULL,
  `sleeptime` varchar(50) DEFAULT NULL,
  `l_num` varchar(50) DEFAULT NULL,
  `def_text` varchar(255) DEFAULT NULL,
  `s_time1` varchar(50) DEFAULT NULL,
  `e_time1` varchar(50) DEFAULT NULL,
  `s_text1` varchar(50) DEFAULT NULL,
  `s_time2` varchar(50) DEFAULT NULL,
  `e_time2` varchar(50) DEFAULT NULL,
  `s_text2` varchar(50) DEFAULT NULL,
  `s_time3` varchar(50) DEFAULT NULL,
  `e_time3` varchar(50) DEFAULT NULL,
  `s_text3` varchar(50) DEFAULT NULL,
  `s_time4` varchar(50) DEFAULT NULL,
  `e_time4` varchar(50) DEFAULT NULL,
  `s_text4` varchar(50) DEFAULT NULL,
  `s_time5` varchar(50) DEFAULT NULL,
  `e_time5` varchar(50) DEFAULT NULL,
  `s_text5` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `led` */

insert  into `led`(`id`,`pno`,`title`,`ip`,`x`,`y`,`width`,`height`,`text`,`fontName`,`fontColor`,`fontsize`,`stunt`,`playspeed`,`bold`,`italic`,`underline`,`sleeptime`,`l_num`,`def_text`,`s_time1`,`e_time1`,`s_text1`,`s_time2`,`e_time2`,`s_text2`,`s_time3`,`e_time3`,`s_text3`,`s_time4`,`e_time4`,`s_text4`,`s_time5`,`e_time5`,`s_text5`) values (1,'1','一号显示屏','192.168.10.71',0,0,928,48,'城市，让生活更美好！\r\n','宋体',255,12,'32',5,'true','false','false','0','','','','','','','','','','','','','','','','',''),(2,'2','二号显示屏','192.168.10.53',0,0,128,16,'城市，让生活更美好！\r\n   ','宋体',255,12,'32',15,'false','false','false','0','','','','','','','','','','','','','','','','',''),(3,'3','三号显示屏','192.168.10.12',0,0,340,43,'城市，让生活更美好！','黑体',255,12,'32',15,'false','false','false','3','','','','','','','','','','','','','','','','',''),(4,'4','四号显示屏','20.31.129.103',0,0,192,32,'上海欢迎你','宋体',255,12,'32',15,'false','false','false','3','','','','','','','','','','','','','','','','',''),(5,'5','五号显示屏','20.31.129.104',0,0,192,32,'上海欢迎你','宋体',255,12,'32',15,'false','false','false','3','','','','','','','','','','','','','','','','',''),(6,'6','六号显示屏','20.31.129.105',0,0,192,32,'上海欢迎你','宋体',255,12,'32',15,'false','false','false','3','','','','','','','','','','','','','','','','',''),(7,'7','七号显示屏','20.31.129.106',0,0,192,32,'上海欢迎你','宋体',255,12,'32',15,'false','false','false','3','','','','','','','','','','','','','','','','',''),(8,'8','八号显示屏','20.31.129.107',0,0,192,32,'上海欢迎你','宋体',255,12,'32',15,'false','false','false','3','','','','','','','','','','','','','','','','',''),(9,'9','九号显示屏','20.31.129.108',0,0,128,48,'上海欢迎你','宋体',255,12,'32',15,'false','false','false','3','','','','','','','','','','','','','','','','',''),(10,'10','十号显示屏','20.31.129.109',0,0,128,48,'上海欢迎你','宋体',255,12,'32',15,'false','false','false','3','','','','','','','','','','','','','','','','',''),(11,'11','十一号显示屏','20.31.129.110',0,0,128,48,'上海欢迎你','宋体',255,12,'32',15,'false','false','false','3','','','','','','','','','','','','','','','','',''),(12,'12','十二号显示屏','20.31.129.111',0,0,128,64,'上海欢迎你','宋体',255,12,'32',15,'false','false','false','3','','','','','','','','','','','','','','','','',''),(13,'13','十三号显示屏','20.31.129.112',0,0,128,64,'上海欢迎你','宋体',255,12,'32',15,'false','false','false','3','','','','','','','','','','','','','','','','',''),(14,'14','十四号显示屏','20.31.129.113',0,0,192,32,'上海欢迎你','宋体',255,12,'32',15,'false','false','false','3','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL),(15,'15','十五号显示屏','20.31.129.114',0,0,192,32,'上海欢迎你','宋体',255,12,'32',15,'false','false','false','3','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL),(16,'16','十六号显示屏','20.31.129.115',0,0,192,32,'上海欢迎你','宋体',255,12,'32',15,'false','false','false','3','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL),(17,'17','十七号显示屏','20.31.129.116',0,0,128,48,'上海欢迎你','宋体',255,12,'32',15,'false','false','false','3','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL),(18,'18','十八号显示屏','20.31.129.117',0,0,128,48,'上海欢迎你','宋体',255,12,'32',15,'false','false','false','3','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL),(19,'19','十九号显示屏','20.31.129.118',0,0,128,48,'上海欢迎你','宋体',255,12,'32',15,'false','false','false','3','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL),(20,'20','二十号显示屏','20.31.129.119',0,0,128,64,'上海欢迎你','宋体',255,12,'32',15,'false','false','false','3','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL),(22,'192.168.10.71','led条屏**','192.168.10.199',0,0,128,16,'上海欢迎你\r\n2.科目以提交时选择的科目为准（不以模板中的为标准）。如您填写的学生学号和学生姓名输入有误提交后无法显示该学生成绩','黑体',1,12,'4',3,'false','false','false','0','0x0252','','','','','','','','','','','','','','','',''),(23,'192.168.10.109','led条屏**','192.168.10.199',0,0,128,16,'上海彩豹信息科技有限公司','微软雅黑',1,12,'4',3,'false','false','false','0','0x0252','','','','','','','','','','','','','','','','');

/*Table structure for table `police_substation` */

DROP TABLE IF EXISTS `police_substation`;

CREATE TABLE `police_substation` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `seqno` varchar(50) DEFAULT NULL,
  `roomno` varchar(50) DEFAULT NULL,
  `casecode` varchar(50) DEFAULT NULL,
  `policename` varchar(50) DEFAULT NULL,
  `casecharacter` varchar(200) DEFAULT NULL,
  `suspect` varchar(200) DEFAULT NULL,
  `clientip` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8;

/*Data for the table `police_substation` */

insert  into `police_substation`(`id`,`seqno`,`roomno`,`casecode`,`policename`,`casecharacter`,`suspect`,`clientip`) values (5,'1','33333','3333','333','3333','3333','192.168.10.55'),(6,'2','qqqqq','eeeee','wwww','rrrrr561','ttttt','192.168.10.55'),(7,'3','dddd','ddd','ddd','ddd23444','ddd','192.168.10.55'),(8,'4','大是大非','地方','发的个地方','法的规定','大范甘迪','192.168.10.55'),(9,'1','','','','','','192.168.10.71'),(10,'2','','','','','','192.168.10.71'),(11,'3','','','','','','192.168.10.71'),(12,'4','','','','','','192.168.10.71'),(13,'1','0000','0000','00000','000','0000','192.168.10.131'),(14,'2','','','','','','192.168.10.131'),(15,'3','','','','','','192.168.10.131'),(16,'4','','','','','','192.168.10.131');

/*Table structure for table `screen_type` */

DROP TABLE IF EXISTS `screen_type`;

CREATE TABLE `screen_type` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `s_title` varchar(50) DEFAULT NULL,
  `s_width` int(11) DEFAULT NULL,
  `s_height` int(11) DEFAULT NULL,
  `all_width` int(11) DEFAULT NULL,
  `all_height` int(11) DEFAULT NULL,
  `s_type` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

/*Data for the table `screen_type` */

insert  into `screen_type`(`id`,`s_title`,`s_width`,`s_height`,`all_width`,`all_height`,`s_type`) values (1,'4：3',560,420,560,420,1),(2,'3：4',315,420,315,420,1),(3,'16：9',640,360,640,360,1),(4,'9：16',225,400,225,400,1);

/*Table structure for table `weatherurl` */

DROP TABLE IF EXISTS `weatherurl`;

CREATE TABLE `weatherurl` (
  `Gid` int(11) DEFAULT NULL,
  `Gtext` varchar(50) DEFAULT NULL,
  `Gurl` varchar(200) DEFAULT NULL,
  `GtimeH` int(11) DEFAULT NULL,
  `Gyn` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `weatherurl` */

insert  into `weatherurl`(`Gid`,`Gtext`,`Gurl`,`GtimeH`,`Gyn`) values (1,'北京','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%B1%B1%BE%A9&dpc=1',1,0),(2,'安徽','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%B0%B2%BB%D5&dpc=1',1,0),(3,'重庆','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%D6%D8%C7%EC&dpc=1',1,0),(4,'福建','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%B8%A3%BD%A8&dpc=1',1,0),(5,'甘肃','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%B8%CA%CB%E0&dpc=1',1,0),(6,'广东','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%B9%E3%B6%AB&dpc=1',1,0),(7,'广西','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%B9%E3%CE%F7&dpc=1',1,0),(8,'贵州','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%B9%F3%D6%DD&dpc=1',1,0),(9,'海南','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%BA%A3%C4%CF&dpc=1',1,0),(10,'河北','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%BA%D3%B1%B1&dpc=1',1,0),(11,'河南','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%BA%D3%C4%CF&dpc=1',1,0),(12,'湖北','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%BA%FE%B1%B1&dpc=1',1,0),(13,'湖南','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%BA%FE%C4%CF&dpc=1',1,0),(14,'黑龙江','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%BA%DA%C1%FA%BD%AD&dpc=1',1,0),(15,'吉林','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%BC%AA%C1%D6&dpc=1',1,0),(16,'江苏','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%BD%AD%CB%D5&dpc=1',1,0),(17,'江西','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%BD%AD%CE%F7&dpc=1',1,0),(18,'辽宁','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%C1%C9%C4%FE&dpc=1',1,0),(19,'内蒙古','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%C4%DA%C3%C9%B9%C5&dpc=1',1,0),(20,'宁夏','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%C4%FE%CF%C4&dpc=1',1,0),(21,'青海','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%C7%E0%BA%A3&dpc=1',1,0),(22,'山东','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%C9%BD%B6%AB&dpc=1',1,0),(23,'陕西','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%C9%C2%CE%F7&dpc=1',1,0),(24,'山西','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%C9%BD%CE%F7&dpc=1',1,0),(25,'上海','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%C9%CF%BA%A3&dpc=1',1,0),(26,'四川','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%CB%C4%B4%A8&dpc=1',1,0),(27,'天津','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%CC%EC%BD%F2&dpc=1',1,0),(28,'西藏','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%CE%F7%B2%D8&dpc=1',1,0),(29,'新疆','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%D0%C2%BD%AE&dpc=1',1,0),(30,'云南','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%D4%C6%C4%CF&dpc=1',1,0),(31,'浙江','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%D5%E3%BD%AD&dpc=1',1,0),(32,'香港','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%CF%E3%B8%DB&dpc=1',1,0),(33,'澳门','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%B0%C4%C3%C5&dpc=1',1,0),(34,'台湾','http://php.weather.sina.com.cn//search_sheng.php?f=1&sheng=%CC%A8%CD%E5&dpc=1',1,0);

/*Table structure for table `xct_city` */

DROP TABLE IF EXISTS `xct_city`;

CREATE TABLE `xct_city` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `province` varchar(100) DEFAULT NULL,
  `city` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1781 DEFAULT CHARSET=utf8;

/*Data for the table `xct_city` */

insert  into `xct_city`(`id`,`province`,`city`) values (1,'北京','北京'),(2,'北京','大兴'),(3,'北京','昌平'),(4,'北京','通州'),(5,'北京','怀柔'),(6,'北京','顺义'),(7,'北京','延庆'),(8,'北京','门头沟'),(9,'北京','房山'),(10,'北京','平谷'),(11,'北京','密云'),(12,'安徽','合肥'),(13,'安徽','长丰'),(14,'安徽','肥西'),(15,'安徽','肥东'),(16,'安徽','黄山'),(17,'安徽','祁门'),(18,'安徽','黟县'),(19,'安徽','歙县'),(20,'安徽','休宁'),(21,'安徽','屯溪'),(22,'安徽','九华山'),(23,'安徽','芜湖'),(24,'安徽','繁昌'),(25,'安徽','南陵'),(26,'安徽','芜湖县'),(27,'安徽','蚌埠'),(28,'安徽','怀远'),(29,'安徽','固镇'),(30,'安徽','五河'),(31,'安徽','淮南'),(32,'安徽','凤台'),(33,'安徽','马鞍山'),(34,'安徽','当涂'),(35,'安徽','淮北'),(36,'安徽','铜陵'),(37,'安徽','安庆'),(38,'安徽','岳西'),(39,'安徽','桐城'),(40,'安徽','太湖'),(41,'安徽','潜山'),(42,'安徽','怀宁'),(43,'安徽','宿松'),(44,'安徽','望江'),(45,'安徽','枞阳'),(46,'安徽','阜阳'),(47,'安徽','临泉'),(48,'安徽','界首'),(49,'安徽','阜南'),(50,'安徽','颍上'),(51,'安徽','太和'),(52,'安徽','宿州'),(53,'安徽','萧县'),(54,'安徽','巢湖'),(55,'安徽','庐江'),(56,'安徽','无为'),(57,'安徽','含山'),(58,'安徽','和县'),(59,'安徽','亳州'),(60,'安徽','涡阳'),(61,'安徽','利辛'),(62,'安徽','蒙城'),(63,'安徽','池州'),(64,'安徽','东至'),(65,'安徽','贵池'),(66,'安徽','石台'),(67,'安徽','青阳'),(68,'安徽','宣城'),(69,'安徽','泾县'),(70,'安徽','旌德'),(71,'安徽','宁国'),(72,'安徽','绩溪'),(73,'安徽','广德'),(74,'安徽','六安'),(75,'安徽','金寨'),(76,'安徽','舒城'),(77,'安徽','寿县'),(78,'安徽','霍山'),(79,'安徽','滁州'),(80,'重庆','重庆'),(81,'重庆','奉节'),(82,'重庆','涪陵'),(83,'重庆','梁平'),(84,'重庆','开县'),(85,'重庆','黔江'),(86,'重庆','潼南'),(87,'重庆','垫江'),(88,'重庆','巫山'),(89,'重庆','江津'),(90,'重庆','合川'),(91,'重庆','永川'),(92,'重庆','丰都'),(93,'重庆','北碚'),(94,'重庆','璧山'),(95,'重庆','南川'),(96,'重庆','长寿'),(97,'重庆','武隆'),(98,'重庆','彭水'),(99,'重庆','綦江'),(100,'重庆','秀山'),(101,'重庆','万州'),(102,'重庆','荣昌'),(103,'重庆','铜梁'),(104,'重庆','城口'),(105,'重庆','巫溪'),(106,'重庆','忠县'),(107,'重庆','石柱'),(108,'重庆','大足'),(109,'重庆','酉阳'),(110,'重庆','江北'),(111,'福建','福州'),(112,'福建','闽清'),(113,'福建','闽侯'),(114,'福建','罗源'),(115,'福建','连江'),(116,'福建','长乐'),(117,'福建','福清'),(118,'福建','平潭'),(119,'福建','永泰'),(120,'福建','厦门'),(121,'福建','同安'),(122,'福建','莆田'),(123,'福建','仙游'),(124,'福建','秀屿'),(125,'福建','三明'),(126,'福建','宁化'),(127,'福建','清流'),(128,'福建','将乐'),(129,'福建','建宁'),(130,'福建','明溪'),(131,'福建','沙县'),(132,'福建','尤溪'),(133,'福建','大田'),(134,'福建','泰宁'),(135,'福建','永安'),(136,'福建','泉州'),(137,'福建','安溪'),(138,'福建','崇武'),(139,'福建','永春'),(140,'福建','德化'),(141,'福建','晋江'),(142,'福建','南安'),(143,'福建','漳州'),(144,'福建','华安'),(145,'福建','南靖'),(146,'福建','平和'),(147,'福建','龙海'),(148,'福建','诏安'),(149,'福建','云霄'),(150,'福建','漳浦'),(151,'福建','东山'),(152,'福建','南平'),(153,'福建','武夷山'),(154,'福建','浦城'),(155,'福建','光泽'),(156,'福建','建阳'),(157,'福建','松溪'),(158,'福建','建瓯'),(159,'福建','顺昌'),(160,'福建','邵武'),(161,'福建','政和'),(162,'福建','龙岩'),(163,'福建','连城'),(164,'福建','武平'),(165,'福建','长汀'),(166,'福建','上杭'),(167,'福建','漳平'),(168,'福建','永定'),(169,'福建','宁德'),(170,'福建','寿宁'),(171,'福建','周宁'),(172,'福建','福安'),(173,'福建','柘荣'),(174,'福建','古田'),(175,'福建','霞浦'),(176,'福建','屏南'),(177,'福建','福鼎'),(178,'甘肃','兰州'),(179,'甘肃','皋兰'),(180,'甘肃','榆中'),(181,'甘肃','永登'),(182,'甘肃','白银'),(183,'甘肃','会宁'),(184,'甘肃','景泰'),(185,'甘肃','靖远'),(186,'甘肃','天水'),(187,'甘肃','甘谷'),(188,'甘肃','武山'),(189,'甘肃','清水'),(190,'甘肃','张家川'),(191,'甘肃','嘉峪关'),(192,'甘肃','酒泉'),(193,'甘肃','敦煌'),(194,'甘肃','瓜州'),(195,'甘肃','玉门'),(196,'甘肃','金塔'),(197,'甘肃','肃北'),(198,'甘肃','武威'),(199,'甘肃','古浪'),(200,'甘肃','民勤'),(201,'甘肃','张掖'),(202,'甘肃','临泽'),(203,'甘肃','民乐'),(204,'甘肃','肃南'),(205,'甘肃','山丹'),(206,'甘肃','平凉'),(207,'甘肃','泾川'),(208,'甘肃','灵台'),(209,'甘肃','静宁'),(210,'甘肃','庄浪'),(211,'甘肃','华亭'),(212,'甘肃','崇信'),(213,'甘肃','庆阳'),(214,'甘肃','华池'),(215,'甘肃','镇原'),(216,'甘肃','合水'),(217,'甘肃','宁县'),(218,'甘肃','正宁'),(219,'甘肃','西峰'),(220,'甘肃','环县'),(221,'甘肃','定西'),(222,'甘肃','陇西'),(223,'甘肃','通渭'),(224,'甘肃','渭源'),(225,'甘肃','漳县'),(226,'甘肃','临洮'),(227,'甘肃','岷县'),(228,'甘肃','甘南'),(229,'甘肃','夏河'),(230,'甘肃','临潭'),(231,'甘肃','卓尼'),(232,'甘肃','碌曲'),(233,'甘肃','迭部'),(234,'甘肃','舟曲'),(235,'甘肃','玛曲'),(236,'甘肃','合作'),(237,'甘肃','临夏'),(238,'甘肃','永靖'),(239,'甘肃','广河'),(240,'甘肃','和政'),(241,'甘肃','康乐'),(242,'广东','广州'),(243,'广东','从化'),(244,'广东','增城'),(245,'广东','番禺'),(246,'广东','汕头'),(247,'广东','潮阳'),(248,'广东','澄海'),(249,'广东','南澳'),(250,'广东','深圳'),(251,'广东','珠海'),(252,'广东','斗门'),(253,'广东','湛江'),(254,'广东','遂溪'),(255,'广东','廉江'),(256,'广东','吴川'),(257,'广东','徐闻'),(258,'广东','雷州'),(259,'广东','佛山'),(260,'广东','三水'),(261,'广东','南海'),(262,'广东','顺德'),(263,'广东','梅州'),(264,'广东','平远'),(265,'广东','蕉岭'),(266,'广东','大埔'),(267,'广东','丰顺'),(268,'广东','梅县'),(269,'广东','五华'),(270,'广东','兴宁'),(271,'广东','肇庆'),(272,'广东','封开'),(273,'广东','怀集'),(274,'广东','四会'),(275,'广东','德庆'),(276,'广东','广宁'),(277,'广东','高要'),(278,'广东','阳江'),(279,'广东','阳春'),(280,'广东','韶关'),(281,'广东','乐昌'),(282,'广东','仁化'),(283,'广东','乳源'),(284,'广东','曲江'),(285,'广东','始兴'),(286,'广东','翁源'),(287,'广东','新丰'),(288,'广东','南雄'),(289,'广东','江门'),(290,'广东','恩平'),(291,'广东','新会'),(292,'广东','台山'),(293,'广东','鹤山'),(294,'广东','开平'),(295,'广东','茂名'),(296,'广东','高州'),(297,'广东','化州'),(298,'广东','电白'),(299,'广东','信宜'),(300,'广东','惠州'),(301,'广东','龙门'),(302,'广东','博罗'),(303,'广东','惠东'),(304,'广东','惠阳'),(305,'广东','汕尾'),(306,'广东','海丰'),(307,'广东','陆丰'),(308,'广东','河源'),(309,'广东','龙川'),(310,'广东','紫金'),(311,'广东','连平'),(312,'广东','和平'),(313,'广东','清远'),(314,'广东','连南'),(315,'广东','连州'),(316,'广东','阳山'),(317,'广东','英德'),(318,'广东','佛冈'),(319,'广东','东莞'),(320,'广东','中山'),(321,'广东','潮州'),(322,'广东','饶平'),(323,'广东','揭阳'),(324,'广东','揭西'),(325,'广东','普宁'),(326,'广东','惠来'),(327,'广东','云浮'),(328,'广东','郁南'),(329,'广东','罗定'),(330,'广东','新兴'),(331,'广西','南宁'),(332,'广西','隆安'),(333,'广西','马山'),(334,'广西','上林'),(335,'广西','武鸣'),(336,'广西','宾阳'),(337,'广西','邕宁'),(338,'广西','横县'),(339,'广西','桂林'),(340,'广西','资源'),(341,'广西','永福'),(342,'广西','临桂'),(343,'广西','灵川'),(344,'广西','全州'),(345,'广西','灌阳'),(346,'广西','阳朔'),(347,'广西','平乐'),(348,'广西','龙胜'),(349,'广西','恭城'),(350,'广西','兴安'),(351,'广西','荔浦'),(352,'广西','北海'),(353,'广西','合浦'),(354,'广西','涠洲岛'),(355,'广西','柳州'),(356,'广西','三江'),(357,'广西','融水'),(358,'广西','柳城'),(359,'广西','柳江'),(360,'广西','融安'),(361,'广西','鹿寨'),(362,'广西','防城港'),(363,'广西','上思'),(364,'广西','防城'),(365,'广西','东兴'),(366,'广西','钦州'),(367,'广西','浦北'),(368,'广西','灵山'),(369,'广西','贵港'),(370,'广西','平南'),(371,'广西','桂平'),(372,'广西','玉林'),(373,'广西','博白'),(374,'广西','北流'),(375,'广西','容县'),(376,'广西','陆川'),(377,'广西','百色'),(378,'广西','隆林'),(379,'广西','乐业'),(380,'广西','凌云'),(381,'广西','田林'),(382,'广西','德保'),(383,'广西','田东'),(384,'广西','田阳'),(385,'广西','那坡'),(386,'广西','靖西'),(387,'广西','平果'),(388,'广西','西林'),(389,'广西','贺州'),(390,'广西','昭平'),(391,'广西','富川'),(392,'广西','钟山'),(393,'广西','河池'),(394,'广西','天峨'),(395,'广西','宜州'),(396,'广西','南丹'),(397,'广西','东兰'),(398,'广西','巴马'),(399,'广西','罗城'),(400,'广西','都安'),(401,'广西','凤山'),(402,'广西','来宾'),(403,'广西','忻城'),(404,'广西','金秀'),(405,'广西','象州'),(406,'广西','武宣'),(407,'广西','崇左'),(408,'广西','天等'),(409,'广西','凭祥'),(410,'广西','大新'),(411,'广西','扶绥'),(412,'广西','宁明'),(413,'广西','龙州'),(414,'广西','梧州'),(415,'广西','藤县'),(416,'广西','苍梧'),(417,'广西','岑溪'),(418,'广西','蒙山'),(419,'贵州','贵阳'),(420,'贵州','息烽'),(421,'贵州','开阳'),(422,'贵州','修文'),(423,'贵州','清镇'),(424,'贵州','六盘水'),(425,'贵州','盘县'),(426,'贵州','六枝'),(427,'贵州','遵义'),(428,'贵州','习水'),(429,'贵州','正安'),(430,'贵州','道真'),(431,'贵州','务川'),(432,'贵州','仁怀'),(433,'贵州','绥阳'),(434,'贵州','湄潭'),(435,'贵州','凤冈'),(436,'贵州','余庆'),(437,'贵州','桐梓'),(438,'贵州','赤水'),(439,'贵州','安顺'),(440,'贵州','普定'),(441,'贵州','平坝'),(442,'贵州','紫云'),(443,'贵州','镇宁'),(444,'贵州','铜仁'),(445,'贵州','毕节'),(446,'海南','海口'),(447,'海南','龙华'),(448,'海南','三亚'),(449,'海南','琼海'),(450,'海南','儋州'),(451,'海南','文昌'),(452,'海南','万宁'),(453,'海南','东方'),(454,'海南','澄迈'),(455,'海南','定安'),(456,'海南','屯昌'),(457,'海南','临高'),(458,'海南','白沙'),(459,'海南','乐东'),(460,'海南','陵水'),(461,'海南','保亭'),(462,'海南','琼中'),(463,'海南','五指山'),(464,'海南','昌江'),(465,'海南','西沙群岛'),(466,'海南','南沙群岛'),(467,'河北','石家庄'),(468,'河北','灵寿'),(469,'河北','行唐'),(470,'河北','正定'),(471,'河北','井陉'),(472,'河北','新乐'),(473,'河北','藁城'),(474,'河北','无极'),(475,'河北','赵县'),(476,'河北','栾城'),(477,'河北','高邑'),(478,'河北','元氏'),(479,'河北','赞皇'),(480,'河北','深泽'),(481,'河北','辛集'),(482,'河北','平山'),(483,'河北','承德'),(484,'河北','隆化'),(485,'河北','平泉'),(486,'河北','滦平'),(487,'河北','兴隆'),(488,'河北','丰宁'),(489,'河北','围场'),(490,'河北','承德县'),(491,'河北','秦皇岛'),(492,'河北','昌黎'),(493,'河北','抚宁'),(494,'河北','北戴河'),(495,'河北','青龙'),(496,'河北','保定'),(497,'河北','涞源'),(498,'河北','曲阳'),(499,'河北','阜平'),(500,'河北','唐县'),(501,'河北','定州'),(502,'河北','涿州'),(503,'河北','容城'),(504,'河北','易县'),(505,'河北','徐水'),(506,'河北','高阳'),(507,'河北','安国'),(508,'河北','安新'),(509,'河北','望都'),(510,'河北','满城'),(511,'河北','蠡县'),(512,'河北','雄县'),(513,'河北','高碑店'),(514,'河北','唐山'),(515,'河北','迁西'),(516,'河北','滦南'),(517,'河北','迁安'),(518,'河北','玉田'),(519,'河北','滦县'),(520,'河北','丰润'),(521,'河北','丰南'),(522,'河北','唐海'),(523,'河北','遵化'),(524,'河北','乐亭'),(525,'河北','邯郸'),(526,'河北','临漳'),(527,'河北','涉县'),(528,'河北','武安'),(529,'河北','曲周'),(530,'河北','永年'),(531,'河北','魏县'),(532,'河北','磁县'),(533,'河北','广平'),(534,'河北','肥乡'),(535,'河北','成安'),(536,'河北','鸡泽'),(537,'河北','大名'),(538,'河北','馆陶'),(539,'河北','丘县'),(540,'河北','邢台'),(541,'河北','沙河'),(542,'河北','柏乡'),(543,'河北','临城'),(544,'河北','隆尧'),(545,'河北','宁晋'),(546,'河北','内丘'),(547,'河北','巨鹿'),(548,'河北','任县'),(549,'河北','南和'),(550,'河北','广宗'),(551,'河北','平乡'),(552,'河北','南宫'),(553,'河北','威县'),(554,'河北','临西'),(555,'河北','清河'),(556,'河北','张家口'),(557,'河北','康保'),(558,'河北','尚义'),(559,'河北','怀安'),(560,'河北','阳原'),(561,'河北','万全'),(562,'河北','沽源'),(563,'河北','崇礼'),(564,'河北','赤城'),(565,'河北','涿鹿'),(566,'河北','张北'),(567,'河北','蔚县'),(568,'河北','怀来'),(569,'河北','宣化'),(570,'河北','沧州'),(571,'河北','河间'),(572,'河北','青县'),(573,'河北','献县'),(574,'河北','肃宁'),(575,'河北','盐山'),(576,'河北','海兴'),(577,'河北','孟村'),(578,'河北','东光'),(579,'河北','吴桥'),(580,'河北','南皮'),(581,'河北','泊头'),(582,'河北','黄骅'),(583,'河北','廊坊'),(584,'河北','大厂'),(585,'河北','固安'),(586,'河北','永清'),(587,'河北','三河'),(588,'河北','香河'),(589,'河北','文安'),(590,'河北','大城'),(591,'河北','霸州'),(592,'河北','衡水'),(593,'河北','饶阳'),(594,'河北','安平'),(595,'河北','武强'),(596,'河北','武邑'),(597,'河北','故城'),(598,'河北','枣强'),(599,'河北','阜城'),(600,'河北','景县'),(601,'河北','冀州'),(602,'河北','任丘'),(603,'河南','郑州'),(604,'河南','荥阳'),(605,'河南','登封'),(606,'河南','新郑'),(607,'河南','中牟'),(608,'河南','新密'),(609,'河南','巩义'),(610,'河南','洛阳'),(611,'河南','宜阳'),(612,'河南','洛宁'),(613,'河南','新安'),(614,'河南','伊川'),(615,'河南','汝阳'),(616,'河南','嵩县'),(617,'河南','偃师'),(618,'河南','孟津'),(619,'河南','栾川'),(620,'河南','开封'),(621,'河南','兰考'),(622,'河南','尉氏'),(623,'河南','杞县'),(624,'河南','通许'),(625,'河南','平顶山'),(626,'河南','汝州'),(627,'河南','鲁山'),(628,'河南','郏县'),(629,'河南','叶县'),(630,'河南','宝丰'),(631,'河南','焦作'),(632,'河南','沁阳'),(633,'河南','博爱'),(634,'河南','修武'),(635,'河南','武陟'),(636,'河南','温县'),(637,'河南','孟州'),(638,'河南','鹤壁'),(639,'河南','淇县'),(640,'河南','浚县'),(641,'河南','新乡'),(642,'河南','安阳'),(643,'河南','汤阴'),(644,'河南','内黄'),(645,'河南','滑县'),(646,'河南','林州'),(647,'河南','濮阳'),(648,'河南','台前'),(649,'河南','南乐'),(650,'河南','清丰'),(651,'河南','范县'),(652,'河南','许昌'),(653,'河南','长葛'),(654,'河南','禹州'),(655,'河南','鄢陵'),(656,'河南','襄城'),(657,'河南','漯河'),(658,'河南','三门峡'),(659,'河南','灵宝'),(660,'河南','渑池'),(661,'河南','卢氏'),(662,'河南','南阳'),(663,'河南','镇平'),(664,'河南','方城'),(665,'河南','社旗'),(666,'河南','淅川'),(667,'河南','新野'),(668,'河南','唐河'),(669,'河南','邓州'),(670,'河南','西峡'),(671,'河南','南召'),(672,'河南','信阳'),(673,'河南','周口'),(674,'河南','驻马店'),(675,'河南','济源'),(676,'河南','商丘'),(677,'河南','睢县'),(678,'河南','民权'),(679,'河南','虞城'),(680,'河南','柘城'),(681,'河南','宁陵'),(682,'河南','夏邑'),(683,'河南','永城'),(684,'湖北','武汉'),(685,'湖北','汉阳'),(686,'湖北','新洲'),(687,'湖北','武昌'),(688,'湖北','宜昌'),(689,'湖北','秭归'),(690,'湖北','远安'),(691,'湖北','当阳'),(692,'湖北','长阳'),(693,'湖北','枝江'),(694,'湖北','五峰'),(695,'湖北','兴山'),(696,'湖北','恩施'),(697,'湖北','巴东'),(698,'湖北','利川'),(699,'湖北','建始'),(700,'湖北','咸丰'),(701,'湖北','鹤峰'),(702,'湖北','黄石'),(703,'湖北','大冶'),(704,'湖北','阳新'),(705,'湖北','襄阳'),(706,'湖北','谷城'),(707,'湖北','保康'),(708,'湖北','南漳'),(709,'湖北','枣阳'),(710,'湖北','宜城'),(711,'湖北','老河口'),(712,'湖北','荆门'),(713,'湖北','京山'),(714,'湖北','钟祥'),(715,'湖北','鄂州'),(716,'湖北','孝感'),(717,'湖北','安陆'),(718,'湖北','云梦'),(719,'湖北','大悟'),(720,'湖北','应城'),(721,'湖北','汉川'),(722,'湖北','黄冈'),(723,'湖北','红安'),(724,'湖北','罗田'),(725,'湖北','浠水'),(726,'湖北','黄梅'),(727,'湖北','麻城'),(728,'湖北','英山'),(729,'湖北','蕲春'),(730,'湖北','咸宁'),(731,'湖北','崇阳'),(732,'湖北','通城'),(733,'湖北','通山'),(734,'湖北','嘉鱼'),(735,'湖北','赤壁'),(736,'湖北','仙桃'),(737,'湖北','天门'),(738,'湖北','潜江'),(739,'湖北','神农架'),(740,'湖北','荆州'),(741,'湖北','松滋'),(742,'湖北','公安'),(743,'湖北','石首'),(744,'湖北','监利'),(745,'湖北','洪湖'),(746,'湖北','十堰'),(747,'湖北','竹溪'),(748,'湖北','竹山'),(749,'湖北','丹江口'),(750,'湖北','郧西'),(751,'湖北','房县'),(752,'湖南','长沙'),(753,'湖南','宁乡'),(754,'湖南','浏阳'),(755,'湖南','张家界'),(756,'湖南','益阳'),(757,'湖南','南县'),(758,'湖南','桃江'),(759,'湖南','安化'),(760,'湖南','沅江'),(761,'湖南','株洲'),(762,'湖南','攸县'),(763,'湖南','茶陵'),(764,'湖南','株州'),(765,'湖南','醴陵'),(766,'湖南','炎陵县'),(767,'湖南','湘潭'),(768,'湖南','湘乡'),(769,'湖南','韶山'),(770,'湖南','衡阳'),(771,'湖南','常宁'),(772,'湖南','衡山'),(773,'湖南','衡南'),(774,'湖南','祁东'),(775,'湖南','耒阳'),(776,'湖南','南岳'),(777,'湖南','衡东'),(778,'湖南','衡阳县'),(779,'湖南','邵阳'),(780,'湖南','洞口'),(781,'湖南','隆回'),(782,'湖南','新邵'),(783,'湖南','邵东'),(784,'湖南','绥宁'),(785,'湖南','新宁'),(786,'湖南','城步'),(787,'湖南','武冈'),(788,'湖南','邵阳县'),(789,'湖南','岳阳'),(790,'湖南','临湘'),(791,'湖南','湘阴'),(792,'湖南','汨罗'),(793,'湖南','平江'),(794,'湖南','华容'),(795,'湖南','常德'),(796,'湖南','郴州'),(797,'湖南','安仁'),(798,'湖南','永兴'),(799,'湖南','桂东'),(800,'湖南','桂阳'),(801,'湖南','嘉禾'),(802,'湖南','宜章'),(803,'湖南','资兴'),(804,'湖南','汝城'),(805,'湖南','临武'),(806,'湖南','怀化'),(807,'湖南','娄底'),(808,'湖南','永州'),(809,'湖南','零陵'),(810,'湖南','江永'),(811,'湖南','东安'),(812,'黑龙江','哈尔滨'),(813,'黑龙江','巴彦'),(814,'黑龙江','双城'),(815,'黑龙江','呼兰'),(816,'黑龙江','宾县'),(817,'黑龙江','木兰'),(818,'黑龙江','方正'),(819,'黑龙江','延寿'),(820,'黑龙江','五常'),(821,'黑龙江','阿城'),(822,'黑龙江','依兰'),(823,'黑龙江','通河'),(824,'黑龙江','尚志'),(825,'黑龙江','大兴安岭'),(826,'黑龙江','漠河'),(827,'黑龙江','塔河'),(828,'黑龙江','呼玛'),(829,'黑龙江','新林'),(830,'黑龙江','黑河'),(831,'黑龙江','逊克'),(832,'黑龙江','孙吴'),(833,'黑龙江','北安'),(834,'黑龙江','嫩江'),(835,'黑龙江','齐齐哈尔'),(836,'黑龙江','讷河'),(837,'黑龙江','克东'),(838,'黑龙江','龙江'),(839,'黑龙江','依安'),(840,'黑龙江','拜泉'),(841,'黑龙江','克山'),(842,'黑龙江','富裕'),(843,'黑龙江','泰来'),(844,'黑龙江','鹤岗'),(845,'黑龙江','双鸭山'),(846,'黑龙江','集贤'),(847,'黑龙江','饶河'),(848,'黑龙江','宝清'),(849,'黑龙江','鸡西'),(850,'黑龙江','密山'),(851,'黑龙江','鸡东'),(852,'黑龙江','大庆'),(853,'黑龙江','林甸'),(854,'黑龙江','杜尔伯特'),(855,'黑龙江','肇源'),(856,'黑龙江','肇州'),(857,'黑龙江','伊春'),(858,'黑龙江','嘉荫'),(859,'黑龙江','乌伊岭'),(860,'黑龙江','五营'),(861,'黑龙江','铁力'),(862,'黑龙江','牡丹江'),(863,'黑龙江','林口'),(864,'黑龙江','海林'),(865,'黑龙江','穆棱'),(866,'黑龙江','宁安'),(867,'黑龙江','东宁'),(868,'黑龙江','绥芬河'),(869,'黑龙江','佳木斯'),(870,'黑龙江','桦川'),(871,'黑龙江','桦南'),(872,'黑龙江','汤原'),(873,'黑龙江','同江'),(874,'黑龙江','富锦'),(875,'黑龙江','抚远'),(876,'黑龙江','七台河'),(877,'黑龙江','勃利'),(878,'黑龙江','绥化'),(879,'黑龙江','绥棱'),(880,'黑龙江','青冈'),(881,'黑龙江','望奎'),(882,'黑龙江','肇东'),(883,'黑龙江','兰西'),(884,'黑龙江','庆安'),(885,'黑龙江','海伦'),(886,'黑龙江','明水'),(887,'黑龙江','安达'),(888,'吉林','长春'),(889,'吉林','榆树'),(890,'吉林','德惠'),(891,'吉林','九台'),(892,'吉林','农安'),(893,'吉林','双阳'),(894,'吉林','吉林'),(895,'吉林','舒兰'),(896,'吉林','蛟河'),(897,'吉林','桦甸'),(898,'吉林','永吉'),(899,'吉林','辽源'),(900,'吉林','通化'),(901,'吉林','梅河口'),(902,'吉林','柳河'),(903,'吉林','辉南'),(904,'吉林','集安'),(905,'吉林','通化县'),(906,'吉林','白山'),(907,'吉林','靖宇'),(908,'吉林','临江'),(909,'吉林','长白'),(910,'吉林','松原'),(911,'吉林','乾安'),(912,'吉林','扶余'),(913,'吉林','长岭'),(914,'吉林','白城'),(915,'吉林','洮南'),(916,'吉林','镇赉'),(917,'吉林','通榆'),(918,'吉林','大安'),(919,'吉林','四平'),(920,'吉林','公主岭'),(921,'吉林','伊通'),(922,'吉林','双辽'),(923,'吉林','梨树'),(924,'吉林','东岗'),(925,'江苏','南京'),(926,'江苏','六合'),(927,'江苏','江宁'),(928,'江苏','高淳'),(929,'江苏','溧水'),(930,'江苏','浦口'),(931,'江苏','苏州'),(932,'江苏','张家港'),(933,'江苏','吴江'),(934,'江苏','常熟'),(935,'江苏','昆山'),(936,'江苏','太仓'),(937,'江苏','无锡'),(938,'江苏','江阴'),(939,'江苏','宜兴'),(940,'江苏','扬州'),(941,'江苏','宝应'),(942,'江苏','仪征'),(943,'江苏','江都'),(944,'江苏','高邮'),(945,'江苏','徐州'),(946,'江苏','丰县'),(947,'江苏','沛县'),(948,'江苏','新沂'),(949,'江苏','睢宁'),(950,'江苏','邳州'),(951,'江苏','常州'),(952,'江苏','金坛'),(953,'江苏','溧阳'),(954,'江苏','南通'),(955,'江苏','海安'),(956,'江苏','如皋'),(957,'江苏','如东'),(958,'江苏','启东'),(959,'江苏','海门'),(960,'江苏','连云港'),(961,'江苏','东海'),(962,'江苏','灌云'),(963,'江苏','灌南'),(964,'江苏','赣榆'),(965,'江苏','淮安'),(966,'江苏','洪泽'),(967,'江苏','涟水'),(968,'江苏','盱眙'),(969,'江苏','盐城'),(970,'江苏','大丰'),(971,'江苏','建湖'),(972,'江苏','阜宁'),(973,'江苏','滨海'),(974,'江苏','东台'),(975,'江苏','射阳'),(976,'江苏','镇江'),(977,'江苏','扬中'),(978,'江苏','丹阳'),(979,'江苏','句容'),(980,'江苏','泰州'),(981,'江苏','兴化'),(982,'江苏','泰兴'),(983,'江苏','靖江'),(984,'江苏','宿迁'),(985,'江苏','泗阳'),(986,'江苏','沭阳'),(987,'江苏','泗洪'),(988,'江西','南昌'),(989,'江西','安义'),(990,'江西','进贤'),(991,'江西','新建'),(992,'江西','南昌县'),(993,'江西','景德镇'),(994,'江西','乐平'),(995,'江西','赣州'),(996,'江西','萍乡'),(997,'江西','莲花'),(998,'江西','新余'),(999,'江西','分宜'),(1000,'江西','九江'),(1001,'江西','庐山'),(1002,'江西','瑞昌'),(1003,'江西','武宁'),(1004,'江西','德安'),(1005,'江西','永修'),(1006,'江西','湖口'),(1007,'江西','彭泽'),(1008,'江西','星子'),(1009,'江西','修水'),(1010,'江西','都昌'),(1011,'江西','鹰潭'),(1012,'江西','余江'),(1013,'江西','贵溪'),(1014,'江西','宜春'),(1015,'江西','抚州'),(1016,'江西','上饶'),(1017,'江西','余干'),(1018,'江西','万年'),(1019,'江西','德兴'),(1020,'江西','弋阳'),(1021,'江西','玉山'),(1022,'江西','铅山'),(1023,'江西','广丰'),(1024,'江西','横峰'),(1025,'江西','鄱阳'),(1026,'江西','上饶县'),(1027,'江西','吉安'),(1028,'江西','安福'),(1029,'江西','永新'),(1030,'江西','井冈山'),(1031,'江西','泰和'),(1032,'江西','新干'),(1033,'江西','峡江'),(1034,'江西','永丰'),(1035,'江西','吉水'),(1036,'江西','万安'),(1037,'江西','宁冈'),(1038,'辽宁','沈阳'),(1039,'辽宁','康平'),(1040,'辽宁','法库'),(1041,'辽宁','辽中'),(1042,'辽宁','新民'),(1043,'辽宁','大连'),(1044,'辽宁','金州'),(1045,'辽宁','长海'),(1046,'辽宁','庄河'),(1047,'辽宁','瓦房店'),(1048,'辽宁','旅顺'),(1049,'辽宁','丹东'),(1050,'辽宁','凤城'),(1051,'辽宁','宽甸'),(1052,'辽宁','鞍山'),(1053,'辽宁','台安'),(1054,'辽宁','岫岩'),(1055,'辽宁','海城'),(1056,'辽宁','锦州'),(1057,'辽宁','北镇'),(1058,'辽宁','义县'),(1059,'辽宁','抚顺'),(1060,'辽宁','新宾'),(1061,'辽宁','清原'),(1062,'辽宁','章党'),(1063,'辽宁','本溪'),(1064,'辽宁','桓仁'),(1065,'辽宁','本溪县'),(1066,'辽宁','葫芦岛'),(1067,'辽宁','建昌'),(1068,'辽宁','兴城'),(1069,'辽宁','绥中'),(1070,'辽宁','营口'),(1071,'辽宁','盖州'),(1072,'辽宁','盘锦'),(1073,'辽宁','大洼'),(1074,'辽宁','盘山'),(1075,'辽宁','阜新'),(1076,'辽宁','太平'),(1077,'辽宁','彰武'),(1078,'辽宁','辽阳'),(1079,'辽宁','灯塔'),(1080,'辽宁','辽阳县'),(1081,'辽宁','铁岭'),(1082,'辽宁','昌图'),(1083,'辽宁','西丰'),(1084,'辽宁','开原'),(1085,'辽宁','朝阳'),(1086,'辽宁','北票'),(1087,'辽宁','凌源'),(1088,'辽宁','喀左'),(1089,'辽宁','建平'),(1090,'内蒙古','呼和浩特'),(1091,'内蒙古','武川'),(1092,'内蒙古','土默特左旗'),(1093,'内蒙古','托克托'),(1094,'内蒙古','和林格尔'),(1095,'内蒙古','阿拉善盟'),(1096,'内蒙古','阿拉善右旗'),(1097,'内蒙古','额济纳旗'),(1098,'内蒙古','包头'),(1099,'内蒙古','固阳'),(1100,'内蒙古','土默特右旗'),(1101,'内蒙古','达尔罕茂明安联合旗'),(1102,'内蒙古','乌海'),(1103,'内蒙古','赤峰'),(1104,'内蒙古','克什克腾旗'),(1105,'内蒙古','喀喇沁旗'),(1106,'内蒙古','宁城'),(1107,'内蒙古','巴林右旗'),(1108,'内蒙古','巴林左旗'),(1109,'内蒙古','林西'),(1110,'内蒙古','翁牛特旗'),(1111,'内蒙古','通辽'),(1112,'内蒙古','奈曼旗'),(1113,'内蒙古','科尔沁左翼后旗'),(1114,'内蒙古','库伦旗'),(1115,'内蒙古','扎鲁特旗'),(1116,'内蒙古','开鲁'),(1117,'内蒙古','科左中旗'),(1118,'内蒙古','呼伦贝尔'),(1119,'内蒙古','陈巴尔虎旗'),(1120,'内蒙古','新巴尔虎左旗'),(1121,'内蒙古','扎兰屯'),(1122,'内蒙古','阿荣旗'),(1123,'内蒙古','牙克石'),(1124,'内蒙古','海拉尔'),(1125,'内蒙古','新巴尔虎右旗'),(1126,'内蒙古','满洲里'),(1127,'内蒙古','根河'),(1128,'内蒙古','莫力达瓦旗'),(1129,'内蒙古','额尔古纳'),(1130,'内蒙古','鄂尔多斯'),(1131,'内蒙古','达拉特旗'),(1132,'内蒙古','杭锦旗'),(1133,'内蒙古','伊金霍洛旗'),(1134,'内蒙古','准格尔旗'),(1135,'内蒙古','东胜'),(1136,'内蒙古','鄂托克前旗'),(1137,'内蒙古','乌审旗'),(1138,'内蒙古','巴彦淖尔'),(1139,'内蒙古','乌拉特后旗'),(1140,'内蒙古','五原'),(1141,'内蒙古','磴口'),(1142,'内蒙古','杭锦后旗'),(1143,'内蒙古','临河'),(1144,'内蒙古','乌拉特中旗'),(1145,'内蒙古','乌拉特前旗'),(1146,'内蒙古','兴安盟'),(1147,'内蒙古','突泉'),(1148,'内蒙古','科尔沁右翼中旗'),(1149,'内蒙古','乌兰浩特'),(1150,'内蒙古','阿尔山'),(1151,'内蒙古','乌兰察布'),(1152,'内蒙古','察哈尔右翼后旗'),(1153,'内蒙古','商都'),(1154,'内蒙古','卓资'),(1155,'内蒙古','凉城'),(1156,'内蒙古','察哈尔右翼前旗'),(1157,'内蒙古','兴和'),(1158,'内蒙古','丰镇'),(1159,'内蒙古','四子王旗'),(1160,'内蒙古','化德'),(1161,'内蒙古','集宁'),(1162,'内蒙古','图里河'),(1163,'内蒙古','博克图'),(1164,'内蒙古','拐子湖'),(1165,'内蒙古','巴音毛道'),(1166,'内蒙古','那仁宝力格'),(1167,'内蒙古','满都拉'),(1168,'内蒙古','海力素'),(1169,'内蒙古','朱日和'),(1170,'内蒙古','吉兰太'),(1171,'内蒙古','锡林郭勒盟'),(1172,'内蒙古','宝国图'),(1173,'宁夏','银川'),(1174,'宁夏','贺兰'),(1175,'宁夏','永宁'),(1176,'宁夏','灵武'),(1177,'宁夏','石嘴山'),(1178,'宁夏','平罗'),(1179,'宁夏','惠农'),(1180,'宁夏','陶乐'),(1181,'宁夏','固原'),(1182,'宁夏','隆德'),(1183,'宁夏','泾源'),(1184,'宁夏','西吉'),(1185,'宁夏','吴忠'),(1186,'宁夏','青铜峡'),(1187,'宁夏','盐池'),(1188,'宁夏','同心'),(1189,'宁夏','中卫'),(1190,'宁夏','中宁'),(1191,'青海','西宁'),(1192,'青海','湟源'),(1193,'青海','湟中'),(1194,'青海','海东'),(1195,'青海','互助'),(1196,'青海','乐都'),(1197,'青海','化隆'),(1198,'青海','循化'),(1199,'青海','民和'),(1200,'青海','果洛'),(1201,'青海','甘德'),(1202,'青海','玛多'),(1203,'青海','达日'),(1204,'青海','久治'),(1205,'青海','班玛'),(1206,'青海','玉树'),(1207,'青海','治多'),(1208,'青海','杂多'),(1209,'青海','曲麻莱'),(1210,'青海','囊谦'),(1211,'山东','济南'),(1212,'山东','商河'),(1213,'山东','章丘'),(1214,'山东','平阴'),(1215,'山东','济阳'),(1216,'山东','青岛'),(1217,'山东','胶州'),(1218,'山东','莱西'),(1219,'山东','崂山'),(1220,'山东','即墨'),(1221,'山东','胶南'),(1222,'山东','平度'),(1223,'山东','烟台'),(1224,'山东','莱州'),(1225,'山东','蓬莱'),(1226,'山东','招远'),(1227,'山东','福山'),(1228,'山东','牟平'),(1229,'山东','长岛'),(1230,'山东','龙口'),(1231,'山东','莱阳'),(1232,'山东','海阳'),(1233,'山东','栖霞'),(1234,'山东','威海'),(1235,'山东','文登'),(1236,'山东','乳山'),(1237,'山东','荣成'),(1238,'山东','潍坊'),(1239,'山东','青州'),(1240,'山东','寿光'),(1241,'山东','临朐'),(1242,'山东','昌乐'),(1243,'山东','高密'),(1244,'山东','诸城'),(1245,'山东','昌邑'),(1246,'山东','安丘'),(1247,'山东','淄博'),(1248,'山东','高青'),(1249,'山东','博山'),(1250,'山东','周村'),(1251,'山东','桓台'),(1252,'山东','临淄'),(1253,'山东','淄川'),(1254,'山东','沂源'),(1255,'山东','枣庄'),(1256,'山东','东营'),(1257,'山东','利津'),(1258,'山东','广饶'),(1259,'山东','垦利'),(1260,'山东','济宁'),(1261,'山东','梁山'),(1262,'山东','汶上'),(1263,'山东','泗水'),(1264,'山东','微山'),(1265,'山东','鱼台'),(1266,'山东','金乡'),(1267,'山东','兖州'),(1268,'山东','曲阜'),(1269,'山东','邹城'),(1270,'山东','泰安'),(1271,'山东','肥城'),(1272,'山东','东平'),(1273,'山东','新泰'),(1274,'山东','宁阳'),(1275,'山东','日照'),(1276,'山东','莒县'),(1277,'山东','莱芜'),(1278,'山东','德州'),(1279,'山东','武城'),(1280,'山东','临邑'),(1281,'山东','宁津'),(1282,'山东','平原'),(1283,'山东','乐陵'),(1284,'山东','庆云'),(1285,'山东','夏津'),(1286,'山东','禹城'),(1287,'山东','齐河'),(1288,'山东','陵县'),(1289,'山东','临沂'),(1290,'山东','平邑'),(1291,'山东','费县'),(1292,'山东','沂水'),(1293,'山东','沂南'),(1294,'山东','莒南'),(1295,'山东','苍山'),(1296,'山东','临沭'),(1297,'山东','郯城'),(1298,'山东','聊城'),(1299,'山东','临清'),(1300,'山东','冠县'),(1301,'山东','阳谷'),(1302,'山东','高唐'),(1303,'山东','茌平'),(1304,'山东','东阿'),(1305,'山东','滨州'),(1306,'山东','无棣'),(1307,'山东','阳信'),(1308,'山东','沾化'),(1309,'山东','惠民'),(1310,'山东','博兴'),(1311,'山东','邹平'),(1312,'山东','菏泽'),(1313,'山东','郓城'),(1314,'山东','东明'),(1315,'山东','巨野'),(1316,'山东','曹县'),(1317,'山东','成武'),(1318,'山东','单县'),(1319,'山东','鄄城'),(1320,'山东','定陶'),(1321,'陕西','西安'),(1322,'陕西','周至'),(1323,'陕西','高陵'),(1324,'陕西','临潼'),(1325,'陕西','户县'),(1326,'陕西','长安'),(1327,'陕西','蓝田'),(1328,'陕西','延安'),(1329,'陕西','志丹'),(1330,'陕西','甘泉'),(1331,'陕西','延长'),(1332,'陕西','宜川'),(1333,'陕西','富县'),(1334,'陕西','黄陵'),(1335,'陕西','黄龙'),(1336,'陕西','延川'),(1337,'陕西','铜川'),(1338,'陕西','宜君'),(1339,'陕西','耀州'),(1340,'陕西','宝鸡'),(1341,'陕西','陇县'),(1342,'陕西','千阳'),(1343,'陕西','麟游'),(1344,'陕西','岐山'),(1345,'陕西','凤翔'),(1346,'陕西','扶风'),(1347,'陕西','眉县'),(1348,'陕西','太白'),(1349,'陕西','凤县'),(1350,'陕西','汉中'),(1351,'陕西','渭南'),(1352,'陕西','合阳'),(1353,'陕西','澄城'),(1354,'陕西','白水'),(1355,'陕西','蒲城'),(1356,'陕西','富平'),(1357,'陕西','大荔'),(1358,'陕西','华县'),(1359,'陕西','华阴'),(1360,'陕西','潼关'),(1361,'陕西','韩城'),(1362,'陕西','榆林'),(1363,'陕西','安康'),(1364,'陕西','宁陕'),(1365,'陕西','汉阴'),(1366,'陕西','紫阳'),(1367,'陕西','平利'),(1368,'陕西','旬阳'),(1369,'陕西','镇坪'),(1370,'陕西','白河'),(1371,'陕西','石泉'),(1372,'陕西','岚皋'),(1373,'陕西','商洛'),(1374,'陕西','咸阳'),(1375,'山西','太原'),(1376,'山西','娄烦'),(1377,'山西','阳曲'),(1378,'山西','清徐'),(1379,'山西','大同'),(1380,'山西','阳高'),(1381,'山西','天镇'),(1382,'山西','左云'),(1383,'山西','浑源'),(1384,'山西','广灵'),(1385,'山西','大同县'),(1386,'山西','灵丘'),(1387,'山西','阳泉'),(1388,'山西','盂县'),(1389,'山西','平定'),(1390,'山西','长治'),(1391,'山西','平顺'),(1392,'山西','沁县'),(1393,'山西','潞城'),(1394,'山西','壶关'),(1395,'山西','屯留'),(1396,'山西','长子'),(1397,'山西','襄垣'),(1398,'山西','沁源'),(1399,'山西','武乡'),(1400,'山西','黎城'),(1401,'山西','晋城'),(1402,'山西','沁水'),(1403,'山西','高平'),(1404,'山西','陵川'),(1405,'山西','阳城'),(1406,'山西','朔州'),(1407,'山西','怀仁'),(1408,'山西','应县'),(1409,'山西','山阴'),(1410,'山西','平鲁'),(1411,'山西','右玉'),(1412,'山西','忻州'),(1413,'山西','保德'),(1414,'山西','五台山'),(1415,'山西','定襄'),(1416,'山西','代县'),(1417,'山西','繁峙'),(1418,'山西','宁武'),(1419,'山西','神池'),(1420,'山西','五寨'),(1421,'山西','岢岚'),(1422,'山西','静乐'),(1423,'山西','偏关'),(1424,'山西','河曲'),(1425,'山西','原平'),(1426,'山西','五台'),(1427,'山西','临汾'),(1428,'山西','永和'),(1429,'山西','大宁'),(1430,'山西','吉县'),(1431,'山西','襄汾'),(1432,'山西','蒲县'),(1433,'山西','汾西'),(1434,'山西','洪洞'),(1435,'山西','霍州'),(1436,'山西','古县'),(1437,'山西','安泽'),(1438,'山西','乡宁'),(1439,'山西','曲沃'),(1440,'山西','翼城'),(1441,'山西','浮山'),(1442,'山西','隰县'),(1443,'山西','侯马'),(1444,'山西','运城'),(1445,'上海','上海'),(1446,'上海','崇明'),(1447,'上海','宝山'),(1448,'上海','金山'),(1449,'上海','青浦'),(1450,'上海','南汇'),(1451,'上海','奉贤'),(1452,'上海','松江'),(1453,'四川','成都'),(1454,'四川','温江'),(1455,'四川','郫县'),(1456,'四川','新津'),(1457,'四川','蒲江'),(1458,'四川','邛崃'),(1459,'四川','大邑'),(1460,'四川','龙泉驿'),(1461,'四川','双流'),(1462,'四川','新都'),(1463,'四川','金堂'),(1464,'四川','都江堰'),(1465,'四川','绵阳'),(1466,'四川','安县'),(1467,'四川','江油'),(1468,'四川','梓潼'),(1469,'四川','三台'),(1470,'四川','盐亭'),(1471,'四川','平武'),(1472,'四川','北川'),(1473,'四川','自贡'),(1474,'四川','荣县'),(1475,'四川','富顺'),(1476,'四川','攀枝花'),(1477,'四川','盐边'),(1478,'四川','米易'),(1479,'四川','仁和'),(1480,'四川','德阳'),(1481,'四川','什邡'),(1482,'四川','中江'),(1483,'四川','广汉'),(1484,'四川','绵竹'),(1485,'四川','广元'),(1486,'四川','青川'),(1487,'四川','剑阁'),(1488,'四川','旺苍'),(1489,'四川','苍溪'),(1490,'四川','遂宁'),(1491,'四川','射洪'),(1492,'四川','蓬溪'),(1493,'四川','乐山'),(1494,'四川','峨眉山'),(1495,'四川','夹江'),(1496,'四川','峨边'),(1497,'四川','犍为'),(1498,'四川','井研'),(1499,'四川','马边'),(1500,'四川','沐川'),(1501,'四川','南充'),(1502,'四川','西充'),(1503,'四川','南部'),(1504,'四川','仪陇'),(1505,'四川','蓬安'),(1506,'四川','营山'),(1507,'四川','阆中'),(1508,'四川','宜宾'),(1509,'四川','南溪'),(1510,'四川','屏山'),(1511,'四川','兴文'),(1512,'四川','筠连'),(1513,'四川','珙县'),(1514,'四川','高县'),(1515,'四川','江安'),(1516,'四川','长宁'),(1517,'四川','宜宾县'),(1518,'四川','广安'),(1519,'四川','岳池'),(1520,'四川','邻水'),(1521,'四川','武胜'),(1522,'四川','达州'),(1523,'四川','雅安'),(1524,'四川','宝兴'),(1525,'四川','天全'),(1526,'四川','芦山'),(1527,'四川','名山'),(1528,'四川','汉源'),(1529,'四川','石棉'),(1530,'四川','巴中'),(1531,'四川','南江'),(1532,'四川','通江'),(1533,'四川','平昌'),(1534,'四川','资阳'),(1535,'四川','简阳'),(1536,'四川','乐至'),(1537,'四川','安岳'),(1538,'四川','阿坝'),(1539,'四川','壤塘'),(1540,'四川','南坪'),(1541,'四川','理县'),(1542,'四川','黑水'),(1543,'四川','茂县'),(1544,'四川','马尔康'),(1545,'四川','红原'),(1546,'四川','小金'),(1547,'四川','松潘'),(1548,'四川','汶川'),(1549,'四川','金川'),(1550,'四川','甘孜'),(1551,'四川','白玉'),(1552,'四川','炉霍'),(1553,'四川','丹巴'),(1554,'四川','泸定'),(1555,'四川','雅江'),(1556,'四川','得荣'),(1557,'四川','乡城'),(1558,'四川','稻城'),(1559,'四川','石渠'),(1560,'四川','德格'),(1561,'四川','道孚'),(1562,'四川','巴塘'),(1563,'四川','新龙'),(1564,'四川','理塘'),(1565,'四川','康定'),(1566,'四川','九龙'),(1567,'四川','泸州'),(1568,'四川','合江'),(1569,'四川','纳溪'),(1570,'四川','古蔺'),(1571,'四川','泸县'),(1572,'四川','叙永'),(1573,'四川','眉山'),(1574,'四川','彭山'),(1575,'四川','仁寿'),(1576,'四川','洪雅'),(1577,'四川','丹棱'),(1578,'四川','青神'),(1579,'天津','天津'),(1580,'天津','塘沽'),(1581,'天津','蓟县'),(1582,'天津','汉沽'),(1583,'天津','大港'),(1584,'天津','东丽'),(1585,'天津','津南'),(1586,'天津','北辰'),(1587,'天津','武清'),(1588,'天津','宝坻'),(1589,'天津','宁河'),(1590,'天津','静海'),(1591,'天津','西青'),(1592,'西藏','拉萨'),(1593,'西藏','当雄'),(1594,'西藏','尼木'),(1595,'西藏','林芝'),(1596,'西藏','察隅'),(1597,'西藏','那曲'),(1598,'西藏','申扎'),(1599,'西藏','嘉黎'),(1600,'西藏','昌都'),(1601,'西藏','洛隆'),(1602,'西藏','左贡'),(1603,'西藏','丁青'),(1604,'西藏','茫康'),(1605,'西藏','泽当'),(1606,'西藏','日喀则'),(1607,'西藏','狮泉河'),(1608,'新疆','乌鲁木齐'),(1609,'新疆','吐鲁番'),(1610,'新疆','托克逊'),(1611,'新疆','鄯善'),(1612,'新疆','伊犁'),(1613,'新疆','克拉玛依'),(1614,'新疆','石河子'),(1615,'新疆','哈密'),(1616,'新疆','巴里坤'),(1617,'新疆','伊吾'),(1618,'新疆','和田'),(1619,'新疆','墨玉'),(1620,'新疆','洛浦'),(1621,'新疆','皮山'),(1622,'新疆','民丰'),(1623,'新疆','于田'),(1624,'新疆','策勤'),(1625,'新疆','阿克苏'),(1626,'新疆','喀什'),(1627,'新疆','昌吉'),(1628,'新疆','玛纳斯'),(1629,'新疆','呼图壁'),(1630,'新疆','阜康'),(1631,'新疆','吉木萨尔'),(1632,'新疆','奇台'),(1633,'新疆','米泉'),(1634,'新疆','木垒'),(1635,'新疆','阿勒泰'),(1636,'新疆','吉木乃'),(1637,'新疆','布尔津'),(1638,'新疆','哈巴河'),(1639,'新疆','福海'),(1640,'新疆','富蕴'),(1641,'新疆','青河'),(1642,'新疆','塔城'),(1643,'新疆','额敏'),(1644,'新疆','裕民'),(1645,'新疆','和布克赛尔'),(1646,'新疆','托里'),(1647,'新疆','乌苏'),(1648,'新疆','沙湾'),(1649,'新疆','阿拉山口'),(1650,'云南','昆明'),(1651,'云南','大理'),(1652,'云南','丽江'),(1653,'云南','宁蒗'),(1654,'云南','永胜'),(1655,'云南','华坪'),(1656,'云南','西双版纳'),(1657,'云南','勐海'),(1658,'云南','景洪'),(1659,'云南','勐腊'),(1660,'云南','普洱'),(1661,'云南','景谷'),(1662,'云南','江城'),(1663,'云南','墨江'),(1664,'云南','西盟'),(1665,'云南','孟连'),(1666,'云南','思茅'),(1667,'云南','景东'),(1668,'云南','澜沧'),(1669,'云南','玉溪'),(1670,'云南','保山'),(1671,'云南','龙陵'),(1672,'云南','施甸'),(1673,'云南','昌宁'),(1674,'云南','腾冲'),(1675,'云南','昭通'),(1676,'云南','临沧'),(1677,'云南','镇康'),(1678,'云南','永德'),(1679,'云南','云县'),(1680,'云南','沧源'),(1681,'云南','双江'),(1682,'云南','耿马'),(1683,'云南','风庆'),(1684,'云南','红河'),(1685,'云南','弥勒'),(1686,'云南','石屏'),(1687,'云南','建水'),(1688,'云南','元阳'),(1689,'云南','绿春'),(1690,'云南','开远'),(1691,'云南','个旧'),(1692,'云南','泸西'),(1693,'云南','蒙自'),(1694,'云南','屏边'),(1695,'云南','楚雄'),(1696,'云南','永仁'),(1697,'云南','大姚'),(1698,'云南','姚安'),(1699,'云南','牟定'),(1700,'云南','南华'),(1701,'云南','武定'),(1702,'云南','禄丰'),(1703,'云南','双柏'),(1704,'云南','元谋'),(1705,'云南','德宏'),(1706,'云南','文山'),(1707,'云南','怒江'),(1708,'云南','兰坪'),(1709,'云南','贡山'),(1710,'浙江','杭州'),(1711,'浙江','富阳'),(1712,'浙江','临安'),(1713,'浙江','萧山'),(1714,'浙江','桐庐'),(1715,'浙江','淳安'),(1716,'浙江','建德'),(1717,'浙江','宁波'),(1718,'浙江','慈溪'),(1719,'浙江','余姚'),(1720,'浙江','镇海'),(1721,'浙江','奉化'),(1722,'浙江','鄞州'),(1723,'浙江','宁海'),(1724,'浙江','象山'),(1725,'浙江','温州'),(1726,'浙江','泰顺'),(1727,'浙江','乐清'),(1728,'浙江','文成'),(1729,'浙江','平阳'),(1730,'浙江','瑞安'),(1731,'浙江','洞头'),(1732,'浙江','嘉兴'),(1733,'浙江','海盐'),(1734,'浙江','嘉善'),(1735,'浙江','海宁'),(1736,'浙江','平湖'),(1737,'浙江','桐乡'),(1738,'浙江','湖州'),(1739,'浙江','安吉'),(1740,'浙江','德清'),(1741,'浙江','长兴'),(1742,'浙江','绍兴'),(1743,'浙江','诸暨'),(1744,'浙江','上虞'),(1745,'浙江','新昌'),(1746,'浙江','舟山'),(1747,'浙江','岱山'),(1748,'浙江','嵊泗'),(1749,'浙江','定海'),(1750,'浙江','衢州'),(1751,'浙江','开化'),(1752,'浙江','龙游'),(1753,'浙江','常山'),(1754,'浙江','江山'),(1755,'浙江','金华'),(1756,'浙江','浦江'),(1757,'浙江','兰溪'),(1758,'浙江','义乌'),(1759,'浙江','东阳'),(1760,'浙江','武义'),(1761,'浙江','永康'),(1762,'浙江','台州'),(1763,'浙江','天台'),(1764,'浙江','洪家'),(1765,'浙江','三门'),(1766,'浙江','仙居'),(1767,'浙江','温岭'),(1768,'浙江','临海'),(1769,'浙江','玉环'),(1770,'浙江','丽水'),(1771,'浙江','缙云'),(1772,'浙江','青田'),(1773,'浙江','云和'),(1774,'浙江','庆元'),(1775,'浙江','遂昌'),(1776,'浙江','龙泉'),(1777,'香港','香港'),(1778,'澳门','澳门'),(1779,'台湾','台北'),(1780,'台湾','高雄');

/*Table structure for table `xct_cnt_response` */

DROP TABLE IF EXISTS `xct_cnt_response`;

CREATE TABLE `xct_cnt_response` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `cnt_ip` varchar(50) DEFAULT NULL,
  `cnt_cmd` varchar(50) DEFAULT NULL,
  `cnt_cmdstatus` varchar(50) DEFAULT NULL,
  `cnt_cmdresult` varchar(255) DEFAULT NULL,
  `cnt_programurl` varchar(50) DEFAULT NULL,
  `cnt_sendtime` varchar(50) DEFAULT NULL,
  `cnt_username` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `xct_cnt_response` */

/*Table structure for table `xct_fault` */

DROP TABLE IF EXISTS `xct_fault`;

CREATE TABLE `xct_fault` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `fault_ip` varchar(20) DEFAULT NULL,
  `fault_time` varchar(12) DEFAULT NULL,
  `fult_reason` varchar(255) DEFAULT NULL,
  `fult_status` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `xct_fault` */

/*Table structure for table `xct_ftp` */

DROP TABLE IF EXISTS `xct_ftp`;

CREATE TABLE `xct_ftp` (
  `Ftp_id` bigint(20) NOT NULL AUTO_INCREMENT,
  `Ftp_IP` varchar(15) DEFAULT NULL,
  `Ftp_User` varchar(50) DEFAULT NULL,
  `Ftp_Pwd` varchar(50) DEFAULT NULL,
  `Ftp_Port` varchar(50) DEFAULT NULL,
  `Ftp_WG` varchar(15) DEFAULT NULL,
  PRIMARY KEY (`Ftp_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `xct_ftp` */

/*Table structure for table `xct_ftpfiles` */

DROP TABLE IF EXISTS `xct_ftpfiles`;

CREATE TABLE `xct_ftpfiles` (
  `Ftp_id` bigint(20) NOT NULL AUTO_INCREMENT,
  `Ftp_FileJM` varchar(50) DEFAULT NULL,
  `Ftp_FileSource` varchar(255) DEFAULT NULL,
  `Ftp_FileProess` varchar(5) DEFAULT NULL,
  `Ftp_FtpFile` varchar(255) DEFAULT NULL,
  `Ftp_IP` varchar(15) DEFAULT NULL,
  `Ftp_delid` varchar(50) DEFAULT NULL,
  `Ftp_user` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`Ftp_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `xct_ftpfiles` */

/*Table structure for table `xct_ipaddress` */

DROP TABLE IF EXISTS `xct_ipaddress`;

CREATE TABLE `xct_ipaddress` (
  `cnt_id` bigint(20) NOT NULL AUTO_INCREMENT,
  `cnt_name` varchar(50) DEFAULT NULL,
  `cnt_ip` varchar(15) DEFAULT NULL,
  `cnt_address` varchar(200) DEFAULT NULL,
  `cnt_port` varchar(50) DEFAULT NULL,
  `cnt_mac` varchar(50) NOT NULL,
  `cnt_miaoshu` varchar(200) DEFAULT NULL,
  `cnt_playstyle` varchar(20) DEFAULT NULL,
  `cnt_kjtime` varchar(10) DEFAULT NULL,
  `cnt_gjtime` varchar(10) DEFAULT NULL,
  `cnt_shutdowntime` varchar(100) DEFAULT NULL,
  `cnt_downtime` varchar(10) DEFAULT NULL,
  `cnt_addtime` varchar(50) DEFAULT NULL,
  `cnt_islink` int(11) DEFAULT NULL,
  `cnt_username` varchar(255) DEFAULT NULL,
  `cnt_zuid` bigint(20) DEFAULT NULL,
  `cnt_nowProgramName` varchar(50) DEFAULT NULL,
  `cnt_status` int(11) DEFAULT NULL,
  `cnt_shutdownopenorstop` varchar(100) DEFAULT NULL,
  `cnt_playprojecttring` varchar(255) DEFAULT NULL,
  `cnt_sheng` varchar(50) DEFAULT NULL,
  `cnt_shi` varchar(50) DEFAULT NULL,
  `client_version` varchar(50) DEFAULT NULL,
  `is_day_download` varchar(50) DEFAULT NULL,
  `access_controller_ip` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`cnt_id`,`cnt_mac`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

/*Data for the table `xct_ipaddress` */

insert  into `xct_ipaddress`(`cnt_id`,`cnt_name`,`cnt_ip`,`cnt_address`,`cnt_port`,`cnt_mac`,`cnt_miaoshu`,`cnt_playstyle`,`cnt_kjtime`,`cnt_gjtime`,`cnt_shutdowntime`,`cnt_downtime`,`cnt_addtime`,`cnt_islink`,`cnt_username`,`cnt_zuid`,`cnt_nowProgramName`,`cnt_status`,`cnt_shutdownopenorstop`,`cnt_playprojecttring`,`cnt_sheng`,`cnt_shi`,`client_version`,`is_day_download`,`access_controller_ip`) values (5,'陈兴','192.168.10.101',NULL,'10001','B39DC975F79','','PLAYER','7','20',NULL,'1','2018-07-28 14:30:33',1,NULL,262,'默认节目',1,NULL,'默认节目#default#2018-07-28 10:00:00#loop#1#',NULL,NULL,'android_xxb_1.7.1','1',NULL);

/*Table structure for table `xct_jmapp` */

DROP TABLE IF EXISTS `xct_jmapp`;

CREATE TABLE `xct_jmapp` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `program_id` varchar(50) DEFAULT NULL,
  `program_jmurl` varchar(50) DEFAULT NULL,
  `program_name` varchar(50) DEFAULT NULL,
  `program_playdate` varchar(50) DEFAULT NULL,
  `program_playtime` varchar(50) DEFAULT NULL,
  `program_enddate` varchar(50) DEFAULT NULL,
  `program_endtime` varchar(50) DEFAULT NULL,
  `program_playlong` int(11) DEFAULT NULL,
  `program_play_type` int(11) DEFAULT NULL,
  `program_play_terminal` varchar(255) DEFAULT NULL,
  `program_sendok_terminal` varchar(255) DEFAULT NULL,
  `program_app_userid` varchar(50) DEFAULT NULL,
  `program_app_time` varchar(50) DEFAULT NULL,
  `program_app_status` int(11) DEFAULT NULL,
  `program_treeid` int(11) DEFAULT NULL,
  `templateid` varchar(50) DEFAULT NULL,
  `batch` int(11) DEFAULT NULL,
  `send_user` varchar(50) DEFAULT NULL,
  `send_time` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=47 DEFAULT CHARSET=utf8;

/*Data for the table `xct_jmapp` */

insert  into `xct_jmapp`(`id`,`program_id`,`program_jmurl`,`program_name`,`program_playdate`,`program_playtime`,`program_enddate`,`program_endtime`,`program_playlong`,`program_play_type`,`program_play_terminal`,`program_sendok_terminal`,`program_app_userid`,`program_app_time`,`program_app_status`,`program_treeid`,`templateid`,`batch`,`send_user`,`send_time`) values (23,'v.0000001','20180728140221','视频','2018-07-28','14:02:00','2018-07-28','14:03:00',1,3,'#511D0CDBA86','','888','2018-07-28 14:03:05',1,0,'t.5a936c75-38c3-40cb-a070-8395b243a4b9',1,'管理员','2018-07-28 14:03:08'),(24,'v.0000002','20180728140221','视频','2018-07-28','14:02:00','2018-07-28','14:03:00',1,0,'#511D0CDBA86','','888','2018-07-28 14:03:05',1,0,'t.5a936c75-38c3-40cb-a070-8395b243a4b9',1,'管理员','2018-07-28 14:03:08'),(25,'v.0000003','20180728140221','视频','2018-07-28','15:02:00','2018-07-28','18:51:00',229,2,'#511D0CDBA86','','888','2018-07-28 14:03:05',1,0,'t.5a936c75-38c3-40cb-a070-8395b243a4b9',1,'管理员','2018-07-28 14:03:08'),(38,'v.0000004','20180728164936','图片','2018-07-28','20:00:00','2018-07-28','20:00:00',30,3,'#B39DC975F79','','888','2018-07-28 16:51:14',1,0,'0',2,'管理员','2018-07-28 16:51:15'),(39,'v.0000005','20180728164936','图片','2018-07-28','20:00:00','2018-07-28','20:00:00',30,3,'#B39DC975F79','','888','2018-07-28 16:57:06',1,0,'0',3,'管理员','2018-07-28 16:57:09'),(40,'v.0000006','20180728164936','图片','2018-07-28','20:00:00','2018-07-28','20:00:00',30,3,'#B39DC975F79','','888','2018-07-28 16:59:13',1,0,'0',4,'管理员','2018-07-28 16:59:20'),(41,'v.0000007','20180728164936','图片','2018-07-28','20:00:00','2018-07-28','20:00:00',30,3,'#B39DC975F79','','888','2018-07-28 17:00:00',1,0,'0',5,'管理员','2018-07-28 17:00:02'),(42,'v.0000008','20180728164936','图片','2018-07-28','20:00:00','2018-07-28','20:00:00',30,3,'#B39DC975F79','','888','2018-07-28 17:03:20',1,0,'0',6,'管理员','2018-07-28 17:03:25'),(43,'v.0000009','20180728164936','图片','2018-07-28','20:00:00','2018-07-28','20:00:00',30,3,'#B39DC975F79','','888','2018-07-28 17:05:32',1,0,'0',7,'管理员','2018-07-28 17:05:40'),(44,'v.0000010','20180728164936','图片','2018-07-28','20:00:00','2018-07-28','20:00:00',30,3,'#B39DC975F79','','888','2018-07-28 17:09:54',1,0,'0',8,'管理员','2018-07-28 17:09:58'),(45,'v.0000011','20180728164936','图片','2018-07-28','20:00:00','2018-07-28','20:00:00',30,3,'#B39DC975F79','','888','2018-07-28 17:14:50',1,0,'0',9,'管理员','2018-07-28 17:14:57'),(46,'v.0000012','20180728164936','图片','2018-07-28','20:00:00','2018-07-28','20:00:00',30,3,'#B39DC975F79','','888','2018-07-28 17:15:49',1,0,'0',10,'管理员','2018-07-28 17:15:53');

/*Table structure for table `xct_jmhistory` */

DROP TABLE IF EXISTS `xct_jmhistory`;

CREATE TABLE `xct_jmhistory` (
  `program_JMid` bigint(20) NOT NULL AUTO_INCREMENT,
  `program_JMurl` varchar(50) DEFAULT NULL,
  `program_Name` varchar(50) DEFAULT NULL,
  `program_SetDateTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `program_Sethour` int(11) DEFAULT NULL,
  `program_Setminute` int(11) DEFAULT NULL,
  `program_SetDate` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `program_EndDate` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `program_EndDateTime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `program_Endhour` int(11) DEFAULT NULL,
  `program_Endminute` int(11) DEFAULT NULL,
  `program_ISloop` int(11) DEFAULT NULL,
  `program_PlaySecond` int(11) DEFAULT NULL,
  `program_lr` longtext,
  `program_lx` varchar(50) DEFAULT NULL,
  `program_playcount` int(11) DEFAULT NULL,
  `program_ggs` varchar(50) DEFAULT NULL,
  `program_ip` varchar(50) DEFAULT NULL,
  `program_delid` varchar(50) DEFAULT NULL,
  `program_issend` int(11) DEFAULT NULL,
  `program_downtime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `program_senduser` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`program_JMid`)
) ENGINE=InnoDB AUTO_INCREMENT=66 DEFAULT CHARSET=utf8;

/*Data for the table `xct_jmhistory` */

/*Table structure for table `xct_jmpz` */

DROP TABLE IF EXISTS `xct_jmpz`;

CREATE TABLE `xct_jmpz` (
  `program_JMid` bigint(20) NOT NULL AUTO_INCREMENT,
  `program_JMurl` varchar(50) DEFAULT NULL,
  `program_Name` varchar(50) DEFAULT NULL,
  `program_SetDateTime` varchar(50) DEFAULT NULL,
  `program_ISloop` int(11) DEFAULT NULL,
  `program_PlaySecond` int(11) DEFAULT NULL,
  `program_lr` longtext,
  `program_lx` varchar(50) DEFAULT NULL,
  `program_playcount` int(11) DEFAULT NULL,
  `program_ggs` varchar(50) DEFAULT NULL,
  `program_ip` varchar(50) DEFAULT NULL,
  `program_downtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `program_adduser` varchar(50) DEFAULT NULL,
  `program_status` int(11) DEFAULT NULL,
  `program_treeid` int(11) DEFAULT NULL,
  `program_isdel` int(11) DEFAULT NULL,
  `templateid` varchar(50) DEFAULT NULL,
  `auditingstatus` int(11) DEFAULT NULL,
  PRIMARY KEY (`program_JMid`)
) ENGINE=InnoDB AUTO_INCREMENT=30 DEFAULT CHARSET=utf8;

/*Data for the table `xct_jmpz` */

insert  into `xct_jmpz`(`program_JMid`,`program_JMurl`,`program_Name`,`program_SetDateTime`,`program_ISloop`,`program_PlaySecond`,`program_lr`,`program_lx`,`program_playcount`,`program_ggs`,`program_ip`,`program_downtime`,`program_adduser`,`program_status`,`program_treeid`,`program_isdel`,`templateid`,`auditingstatus`) values (27,'20180728140221','视频','2018-07-28 14:02:21',1,NULL,NULL,NULL,NULL,NULL,NULL,'2018-07-28 14:37:56','888',0,264,0,'t.5a936c75-38c3-40cb-a070-8395b243a4b9',NULL),(29,'20180728164936','图片','2018-07-28 16:49:36',NULL,NULL,NULL,NULL,NULL,NULL,NULL,'2018-07-28 16:49:37','888',0,264,0,'t.e3018b57-547f-4f0c-8869-683e37f5e22e',NULL);

/*Table structure for table `xct_jmpz_type` */

DROP TABLE IF EXISTS `xct_jmpz_type`;

CREATE TABLE `xct_jmpz_type` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `program_JMurl` varchar(50) DEFAULT NULL,
  `play_type` int(11) DEFAULT NULL,
  `play_start_time` varchar(50) DEFAULT NULL,
  `play_end_time` varchar(50) DEFAULT NULL,
  `play_count` varchar(50) DEFAULT NULL,
  `day_stime1` varchar(50) DEFAULT NULL,
  `day_etime1` varchar(50) DEFAULT NULL,
  `templateid` varchar(50) DEFAULT NULL,
  `type` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=29 DEFAULT CHARSET=utf8;

/*Data for the table `xct_jmpz_type` */

insert  into `xct_jmpz_type`(`id`,`program_JMurl`,`play_type`,`play_start_time`,`play_end_time`,`play_count`,`day_stime1`,`day_etime1`,`templateid`,`type`) values (1,'20160419180412',4,'2016-05-08','2016-05-08','1','20:55:00','20:56:00','t.e96e0591-7338-4bee-a8b3-44ff5e58ca1b',NULL),(2,'20161107210221',4,'2016-11-07','2016-11-07','1','21:02:00','21:03:00','t.1f3e456e-a9b1-4e6d-af9b-f4fb7cec3f82',NULL),(3,'20161107210037',4,'2016-11-07','2016-11-07','1','21:02:00','21:03:00','t.655b3ff5-68c1-49ff-b7a8-ba74c2325c72',NULL),(4,'20161109145427',4,'2016-11-09','2016-11-09','5','14:54:00','14:59:00','t.9285d0ba-d846-414a-bca1-183e562802b8',NULL),(5,'20161109145510',4,'2016-11-09','2016-11-09','10','14:55:00','15:05:00','t.4347207e-2d1d-42ad-b148-98861d1be280',NULL),(6,'20161109145548',4,'2016-11-09','2016-11-09','2','14:55:00','14:57:00','t.16459779-947e-4072-98ca-47c0e039e17e',NULL),(7,'20161109145618',4,'2016-11-09','2016-11-09','5','14:56:00','15:01:00','t.8511288a-249b-44e1-9d0c-f46d33b8bda2',NULL),(8,'20161109145709',4,'2016-11-09','2016-11-09','5','14:57:00','15:02:00','t.547ded0c-6cd5-4294-a7e3-a979dfbdcd87',NULL),(9,'20180725172723',4,'2018-07-25','2018-07-25','1','17:27:00','17:28:00','t.4dd710a1-5936-4844-a350-ef6a68859967',NULL),(10,'20180725172723',3,'2018-07-25','2018-07-25','180','17:27:00','20:27:00','t.4dd710a1-5936-4844-a350-ef6a68859967',NULL),(11,'20180726113930',4,'2018-07-26','2018-07-26','1','11:39:00','11:40:00','t.eac397dd-f300-4e0c-b0b2-fbb7af627b56',NULL),(12,'20180726113930',3,'2018-07-26','2018-07-26','39','11:39:00','12:18:00','t.eac397dd-f300-4e0c-b0b2-fbb7af627b56',NULL),(13,'20180726113930',1,'2018-07-26','2018-07-26','1','11:39:00','11:40:00','t.eac397dd-f300-4e0c-b0b2-fbb7af627b56',NULL),(14,'20180726115610',4,'2018-07-26','2018-07-26','1','11:56:00','11:57:00','t.9b6c062d-7caf-49b7-9b93-f2d37b83d32d',NULL),(15,'20180726115610',1,'2018-07-26','2018-07-26','1','11:56:00','11:57:00','t.9b6c062d-7caf-49b7-9b93-f2d37b83d32d',NULL),(16,'20180726115610',3,'2018-07-26','2018-07-26','22','11:56:00','12:18:00','t.9b6c062d-7caf-49b7-9b93-f2d37b83d32d',NULL),(17,'20180726120241',4,'2018-07-26','2018-07-26','1','12:03:00','12:04:00','t.be4288b6-285d-4e43-b613-6db766362bee',NULL),(18,'20180726120241',1,'2018-07-26','2018-07-26','1','12:03:00','12:04:00','t.be4288b6-285d-4e43-b613-6db766362bee',NULL),(19,'20180726120241',3,'2018-07-26','2018-07-26','408','12:03:00','18:51:00','t.be4288b6-285d-4e43-b613-6db766362bee',NULL),(20,'20180726122657',4,'2018-07-26','2018-07-26','2','12:27:00','12:29:00','t.60a3b922-be08-44c6-a46e-2b5a98524c15',NULL),(21,'20180726122657',1,'2018-07-26','2018-07-26','2','12:27:00','12:29:00','t.60a3b922-be08-44c6-a46e-2b5a98524c15',NULL),(22,'20180726122657',3,'2018-07-26','2018-07-26','384','12:27:00','18:51:00','t.60a3b922-be08-44c6-a46e-2b5a98524c15',NULL),(23,'20180726163301',4,'2018-07-26','2018-07-26','1','16:37:00','16:38:00','t.63daf6af-d881-4892-81bd-c43745cdd8be',NULL),(24,'20180726163301',1,'2018-07-26','2018-07-26','1','16:37:00','16:38:00','t.63daf6af-d881-4892-81bd-c43745cdd8be',NULL),(25,'20180726163301',3,'2018-07-26','2018-07-26','389','16:37:00','23:06:00','t.63daf6af-d881-4892-81bd-c43745cdd8be',NULL),(26,'20180728140221',4,'2018-07-28','2018-07-28','1','14:02:00','14:03:00','t.5a936c75-38c3-40cb-a070-8395b243a4b9',NULL),(27,'20180728140221',1,'2018-07-28','2018-07-28','1','14:02:00','14:03:00','t.5a936c75-38c3-40cb-a070-8395b243a4b9',NULL),(28,'20180728140221',3,'2018-07-28','2018-07-28','229','15:02:00','18:51:00','t.5a936c75-38c3-40cb-a070-8395b243a4b9',NULL);

/*Table structure for table `xct_js` */

DROP TABLE IF EXISTS `xct_js`;

CREATE TABLE `xct_js` (
  `JS_id` bigint(20) NOT NULL AUTO_INCREMENT,
  `JS_name` varchar(30) DEFAULT NULL,
  `JS_qx` varchar(200) DEFAULT NULL,
  PRIMARY KEY (`JS_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `xct_js` */

/*Table structure for table `xct_led` */

DROP TABLE IF EXISTS `xct_led`;

CREATE TABLE `xct_led` (
  `l_id` bigint(20) NOT NULL AUTO_INCREMENT,
  `l_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `l_jyzzb` varchar(50) DEFAULT NULL,
  `l_zbld` varchar(50) DEFAULT NULL,
  `l_zzbs` varchar(50) DEFAULT NULL,
  `l_gdwz` varchar(255) DEFAULT NULL,
  `l_zt` int(11) DEFAULT NULL,
  `l_p1` varchar(10) DEFAULT NULL,
  `l_p2` varchar(10) DEFAULT NULL,
  `l_p3` varchar(10) DEFAULT NULL,
  `l_p4` varchar(10) DEFAULT NULL,
  `l_p5` varchar(10) DEFAULT NULL,
  `l_p6` varchar(10) DEFAULT NULL,
  `l_p7` varchar(10) DEFAULT NULL,
  `l_p8` varchar(10) DEFAULT NULL,
  `l_gdwz1` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`l_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `xct_led` */

/*Table structure for table `xct_lg` */

DROP TABLE IF EXISTS `xct_lg`;

CREATE TABLE `xct_lg` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `lg_name` varchar(100) DEFAULT NULL,
  `lg_password` varchar(100) DEFAULT NULL,
  `name` varchar(50) DEFAULT NULL,
  `email` varchar(100) DEFAULT NULL,
  `last_login_time` varchar(50) DEFAULT NULL,
  `lg_role` varchar(50) DEFAULT NULL,
  `d_perm` varchar(50) DEFAULT NULL,
  `depid` varchar(100) DEFAULT NULL,
  `depname` varchar(100) DEFAULT NULL,
  `emptruename` varchar(100) DEFAULT NULL,
  `empemail` varchar(100) DEFAULT NULL,
  `lg_mac` varchar(255) DEFAULT NULL,
  `lg_authority` varchar(200) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8;

/*Data for the table `xct_lg` */

insert  into `xct_lg`(`id`,`lg_name`,`lg_password`,`name`,`email`,`last_login_time`,`lg_role`,`d_perm`,`depid`,`depname`,`emptruename`,`empemail`,`lg_mac`,`lg_authority`) values (1,'888','0A113EF6B61820DAA5611C870ED8D5EE','管理员','9876@163.com','2018-07-28 16:55:53','1','0',NULL,NULL,NULL,NULL,'','A#B#C#D#E#F#G#H#I#J#K#L#M#N#O#P#Q#R#S#T#U#'),(10,'111','698D51A19D8A121CE581499D7B701668','王碧','1234@163.com','2016-11-09 15:24:09','2',NULL,NULL,NULL,NULL,NULL,NULL,'A#B#C#D#E#F#G#H#I#J#K#L#M#N#O#P#Q#R#S#T#'),(11,'222','BCBE3365E6AC95EA2C0343A2395834DD','王辉','无','2016-11-09 15:20:17','3',NULL,NULL,NULL,NULL,NULL,NULL,'A#B#C#D#E#F#G#H#J#L#M#N#O#P#Q#R#S#T#');

/*Table structure for table `xct_log` */

DROP TABLE IF EXISTS `xct_log`;

CREATE TABLE `xct_log` (
  `logid` bigint(20) NOT NULL AUTO_INCREMENT,
  `loguser` varchar(50) DEFAULT NULL,
  `logdate` varchar(50) DEFAULT NULL,
  `logtime` varchar(50) DEFAULT NULL,
  `loglog` varchar(255) DEFAULT NULL,
  `logdel` int(11) DEFAULT NULL,
  `logtype` int(11) DEFAULT NULL,
  PRIMARY KEY (`logid`)
) ENGINE=InnoDB AUTO_INCREMENT=336 DEFAULT CHARSET=utf8;

/*Data for the table `xct_log` */

insert  into `xct_log`(`logid`,`loguser`,`logdate`,`logtime`,`loglog`,`logdel`,`logtype`) values (268,'管理员','2018-07-28','13:59:55','用户【888】删除了【节目组组下面的节目：视频】；【节目组组下面的节目：图片】；',0,1),(269,'888','2018-07-28','14:00:10','<span >用户888删除了媒体组：【审核员；】以及组下面的媒体【】',0,1),(270,'888','2018-07-28','14:00:15','<span >用户888删除了媒体组：【一般用户；】以及组下面的媒体【】',0,1),(271,'管理员','2018-07-28','14:00:46','用户【管理员】上传了【IMAGE】文件：【Hydrangeas】',0,1),(272,'管理员','2018-07-28','14:00:47','用户【管理员】上传了【IMAGE】文件：【Lighthouse】',0,1),(273,'管理员','2018-07-28','14:00:48','用户【管理员】上传了【IMAGE】文件：【Chrysanthemum】',0,1),(274,'管理员','2018-07-28','14:00:49','用户【管理员】上传了【IMAGE】文件：【Koala】',0,1),(275,'管理员','2018-07-28','14:00:50','用户【管理员】上传了【IMAGE】文件：【Penguins】',0,1),(276,'管理员','2018-07-28','14:00:51','用户【管理员】上传了【IMAGE】文件：【Desert】',0,1),(277,'管理员','2018-07-28','14:00:52','用户【管理员】上传了【IMAGE】文件：【Jellyfish】',0,1),(278,'管理员','2018-07-28','14:00:53','用户【管理员】上传了【IMAGE】文件：【Tulips】',0,1),(279,'管理员','2018-07-28','14:01:42','用户【管理员】上传了【MOVIE】文件：【Wildlife】',0,1),(280,'管理员','2018-07-28','14:02:09','用户【管理员】在节目组【节目组】下面创建了节目：【图片】',0,1),(281,'管理员','2018-07-28','14:02:21','用户【管理员】在节目组【节目组】下面创建了节目：【视频】',0,1),(282,'888','2018-07-28','14:02:29','<span >用户888删除了节目组：【节目组2；】以及组下面的节目【】',0,1),(283,'管理员','2018-07-28','14:03:09','用户【管理员】向终端【cxandroid(511D0CDBA86)】发送了节目：【,视频,视频,视频】',0,1),(284,'管理员','2018-07-28','14:06:18','用户【管理员】向终端【cxandroid(511D0CDBA86)】发送了节目：【,图片】',0,1),(285,'管理员','2018-07-28','14:12:18','用户【管理员】向终端【cxandroid】发送初始化成功！',0,1),(286,'管理员','2018-07-28','14:12:33','用户【管理员】向终端【cxandroid(511D0CDBA86)】发送了节目：【,图片】',0,1),(287,'管理员','2018-07-28','14:27:17','用户【管理员】登陆系统！登录IP为：127.0.0.1',0,1),(288,'管理员','2018-07-28','14:27:51','用户【管理员】登陆系统！登录IP为：192.168.10.142',0,1),(289,'管理员','2018-07-28','14:28:45','用户【管理员】登陆系统！登录IP为：192.168.10.142',0,1),(290,'管理员','2018-07-28','14:31:26','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,图片】',0,1),(291,'管理员','2018-07-28','14:36:45','用户【管理员】在节目组【节目组】下面创建了节目：【测试图片】',0,1),(292,'管理员','2018-07-28','14:37:43','用户【888】删除了【节目组组下面的节目：图片】；',0,1),(293,'管理员','2018-07-28','14:38:11','用户【管理员】向终端【陈兴】发送初始化成功！',0,1),(294,'管理员','2018-07-28','14:38:29','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,测试图片】',0,1),(295,'管理员','2018-07-28','14:49:03','用户【管理员】登陆系统！登录IP为：192.168.10.142',0,1),(296,'管理员','2018-07-28','14:49:46','用户【管理员】登陆系统！登录IP为：192.168.10.142',0,1),(297,'管理员','2018-07-28','14:50:32','<span >用户【管理员】删除了终端：【cxandroid】、',0,1),(298,'管理员','2018-07-28','14:50:52','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,测试图片】',0,1),(299,'管理员','2018-07-28','14:53:25','用户【管理员】向终端【陈兴】发送初始化成功！',0,1),(300,'管理员','2018-07-28','14:54:28','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,测试图片】',0,1),(301,'管理员','2018-07-28','14:57:49','用户【管理员】向终端【陈兴】发送初始化成功！',0,1),(302,'管理员','2018-07-28','14:58:14','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,测试图片】',0,1),(303,'管理员','2018-07-28','15:29:42','用户【管理员】登陆系统！登录IP为：192.168.10.142',0,1),(304,'管理员','2018-07-28','15:30:19','用户【管理员】登陆系统！登录IP为：192.168.10.142',0,1),(305,'管理员','2018-07-28','15:31:48','用户【管理员】向终端【陈兴】发送初始化成功！',0,1),(306,'管理员','2018-07-28','15:32:37','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,测试图片】',0,1),(307,'管理员','2018-07-28','16:13:04','用户【管理员】向终端【陈兴】发送初始化成功！',0,1),(308,'管理员','2018-07-28','16:13:58','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,测试图片】',0,1),(309,'管理员','2018-07-28','16:18:42','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,测试图片】',0,1),(310,'管理员','2018-07-28','16:19:52','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,测试图片】',0,1),(311,'管理员','2018-07-28','16:26:56','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,测试图片】',0,1),(312,'管理员','2018-07-28','16:36:07','用户【管理员】登陆系统！登录IP为：192.168.10.142',0,1),(313,'管理员','2018-07-28','16:37:04','用户【管理员】登陆系统！登录IP为：192.168.10.142',0,1),(314,'管理员','2018-07-28','16:48:58','用户【888】删除了【节目组组下面的节目：测试图片】；',0,1),(315,'管理员','2018-07-28','16:49:37','用户【管理员】在节目组【节目组】下面创建了节目：【图片】',0,1),(316,'管理员','2018-07-28','16:49:55','用户【管理员】向终端【陈兴】发送初始化成功！',0,1),(317,'管理员','2018-07-28','16:50:36','用户【管理员】向终端【陈兴】发送初始化成功！',0,1),(318,'管理员','2018-07-28','16:51:17','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,图片】',0,1),(319,'管理员','2018-07-28','16:55:53','用户【管理员】登陆系统！登录IP为：192.168.10.142',0,1),(320,'管理员','2018-07-28','16:56:41','用户【管理员】向终端【陈兴】发送初始化成功！',0,1),(321,'管理员','2018-07-28','16:57:09','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,图片】',0,1),(322,'管理员','2018-07-28','16:59:15','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,图片】',0,1),(323,'管理员','2018-07-28','16:59:20','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,图片】',0,1),(324,'管理员','2018-07-28','16:59:42','用户【管理员】向终端【陈兴】发送初始化成功！',0,1),(325,'管理员','2018-07-28','17:00:03','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,图片】',0,1),(326,'管理员','2018-07-28','17:02:49','用户【管理员】向终端【陈兴】发送初始化成功！',0,1),(327,'管理员','2018-07-28','17:03:25','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,图片】',0,1),(328,'管理员','2018-07-28','17:05:12','用户【管理员】向终端【陈兴】发送初始化成功！',0,1),(329,'管理员','2018-07-28','17:05:40','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,图片】',0,1),(330,'管理员','2018-07-28','17:09:35','用户【管理员】向终端【陈兴】发送初始化成功！',0,1),(331,'管理员','2018-07-28','17:09:58','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,图片】',0,1),(332,'管理员','2018-07-28','17:14:56','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,图片】',0,1),(333,'管理员','2018-07-28','17:14:57','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,图片】',0,1),(334,'管理员','2018-07-28','17:15:25','用户【管理员】向终端【陈兴】发送初始化成功！',0,1),(335,'管理员','2018-07-28','17:15:53','用户【管理员】向终端【陈兴(B39DC975F79)】发送了节目：【,图片】',0,1);

/*Table structure for table `xct_media` */

DROP TABLE IF EXISTS `xct_media`;

CREATE TABLE `xct_media` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `media_id` varchar(50) DEFAULT NULL,
  `media_title` varchar(255) DEFAULT NULL,
  `media_type` varchar(50) DEFAULT NULL,
  `zu_id` int(11) DEFAULT NULL,
  `group_num` int(11) DEFAULT NULL,
  `m_play_time` varchar(50) DEFAULT NULL,
  `m_resolution` varchar(50) DEFAULT NULL,
  `file_name` varchar(100) DEFAULT NULL,
  `file_size` bigint(20) DEFAULT NULL,
  `file_path` varchar(200) DEFAULT NULL,
  `slightly_img_name` varchar(50) DEFAULT NULL,
  `slightly_img_size` bigint(20) DEFAULT NULL,
  `slightly_img_path` varchar(200) DEFAULT NULL,
  `userid` varchar(50) DEFAULT NULL,
  `create_date` varchar(50) DEFAULT NULL,
  `last_date` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=128 DEFAULT CHARSET=utf8;

/*Data for the table `xct_media` */

insert  into `xct_media`(`id`,`media_id`,`media_title`,`media_type`,`zu_id`,`group_num`,`m_play_time`,`m_resolution`,`file_name`,`file_size`,`file_path`,`slightly_img_name`,`slightly_img_size`,`slightly_img_path`,`userid`,`create_date`,`last_date`) values (119,'media.82d5a527-e4ec-454b-95ff-b82575060023','Hydrangeas','IMAGE',266,0,'8000',NULL,'20180728140046588153.jpg',595284,'/mediafile/img/','20180728140046588153_slightly.jpg',100,'/mediafile/img/','888','2018-07-28 14:00:46','2018-07-28 14:00:46'),(120,'media.52c8fcca-7feb-4937-8422-36c67ac1f787','Lighthouse','IMAGE',266,0,'8000',NULL,'201807281400476763955.jpg',561276,'/mediafile/img/','201807281400476763955_slightly.jpg',100,'/mediafile/img/','888','2018-07-28 14:00:47','2018-07-28 14:00:47'),(121,'media.891eed1b-ee41-4006-953b-b6101893d5be','Chrysanthemum','IMAGE',266,0,'8000',NULL,'201807281400486992080.jpg',879394,'/mediafile/img/','201807281400486992080_slightly.jpg',100,'/mediafile/img/','888','2018-07-28 14:00:48','2018-07-28 14:00:48'),(122,'media.f09da355-b9c7-45ec-8507-509f1adb8f6a','Koala','IMAGE',266,0,'8000',NULL,'201807281400496823124.jpg',780831,'/mediafile/img/','201807281400496823124_slightly.jpg',100,'/mediafile/img/','888','2018-07-28 14:00:49','2018-07-28 14:00:49'),(123,'media.05b9b34f-e478-44dc-ab61-ef792fa1b27d','Penguins','IMAGE',266,0,'8000',NULL,'201807281400507935604.jpg',777835,'/mediafile/img/','201807281400507935604_slightly.jpg',100,'/mediafile/img/','888','2018-07-28 14:00:50','2018-07-28 14:00:50'),(124,'media.4c344b8d-1d07-4dec-be97-29844d0a198f','Desert','IMAGE',266,0,'8000',NULL,'201807281400516571842.jpg',845941,'/mediafile/img/','201807281400516571842_slightly.jpg',100,'/mediafile/img/','888','2018-07-28 14:00:51','2018-07-28 14:00:51'),(125,'media.3a9a505a-de89-4924-ac87-b0fe6a8f6bd7','Jellyfish','IMAGE',266,0,'8000',NULL,'20180728140052646553.jpg',775702,'/mediafile/img/','20180728140052646553_slightly.jpg',100,'/mediafile/img/','888','2018-07-28 14:00:52','2018-07-28 14:00:52'),(126,'media.ef171170-42f6-483a-8b6a-6d43233ed0a8','Tulips','IMAGE',266,0,'8000',NULL,'201807281400536773115.jpg',620888,'/mediafile/img/','201807281400536773115_slightly.jpg',100,'/mediafile/img/','888','2018-07-28 14:00:53','2018-07-28 14:00:53'),(127,'media.e0e0d9fd-7b97-4599-a3fa-cfffa96ce0c5','Wildlife','MOVIE',267,1,'30000',NULL,'201807281401407761856.wmv',26246026,'/mediafile/video/','201807281401407761856_slightly.jpg',100,'/mediafile/video/','888','2018-07-28 14:01:42','2018-07-28 14:01:42');

/*Table structure for table `xct_module` */

DROP TABLE IF EXISTS `xct_module`;

CREATE TABLE `xct_module` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `area_id` int(11) DEFAULT NULL,
  `m_left` int(11) DEFAULT NULL,
  `m_top` int(11) DEFAULT NULL,
  `m_width` int(11) DEFAULT NULL,
  `m_height` int(11) DEFAULT NULL,
  `template_id` varchar(50) DEFAULT NULL,
  `m_filetype` varchar(50) DEFAULT NULL,
  `media_id` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8;

/*Data for the table `xct_module` */

insert  into `xct_module`(`id`,`area_id`,`m_left`,`m_top`,`m_width`,`m_height`,`template_id`,`m_filetype`,`media_id`) values (1,1,0,0,640,360,'t.0000002','',''),(2,1,0,0,225,400,'t.0000003','',''),(3,1,22,73,603,217,'t.0000004','',''),(4,2,480,4,131,45,'t.0000004','',''),(5,3,0,311,558,38,'t.0000004','',''),(6,1,0,0,246,420,'t.0000005','',''),(7,2,248,0,312,200,'t.0000005','',''),(8,3,248,200,312,220,'t.0000005','',''),(10,1,0,0,560,420,'t.0000006','','');

/*Table structure for table `xct_module_media` */

DROP TABLE IF EXISTS `xct_module_media`;

CREATE TABLE `xct_module_media` (
  `id` int(11) unsigned zerofill NOT NULL AUTO_INCREMENT COMMENT '主键自增',
  `module_id` int(11) DEFAULT NULL,
  `media_id` varchar(50) DEFAULT NULL,
  `type` int(11) DEFAULT NULL,
  `sequence` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=88 DEFAULT CHARSET=utf8;

/*Data for the table `xct_module_media` */

insert  into `xct_module_media`(`id`,`module_id`,`media_id`,`type`,`sequence`) values (00000000001,2071,'media.f2fd2f74-c81b-45a7-9242-07fafa4d8514',0,1),(00000000003,23,'media.b56701ad-fc88-4ef7-bbe8-afec7abb97cf',0,1),(00000000083,48,'media.e0e0d9fd-7b97-4599-a3fa-cfffa96ce0c5',0,1),(00000000087,50,'media.f09da355-b9c7-45ec-8507-509f1adb8f6a',0,1);

/*Table structure for table `xct_module_temp` */

DROP TABLE IF EXISTS `xct_module_temp`;

CREATE TABLE `xct_module_temp` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id 自增字段',
  `area_id` int(11) DEFAULT NULL,
  `m_left` int(11) DEFAULT NULL,
  `m_top` int(11) DEFAULT NULL,
  `m_width` int(11) DEFAULT NULL,
  `m_height` int(11) DEFAULT NULL,
  `template_id` varchar(50) DEFAULT NULL,
  `m_filetype` varchar(50) DEFAULT NULL,
  `m_other` varchar(255) DEFAULT NULL,
  `m_text` longtext,
  `name` varchar(50) DEFAULT NULL,
  `background` varchar(50) DEFAULT NULL,
  `foreground` varchar(50) DEFAULT NULL,
  `span` varchar(50) DEFAULT NULL,
  `fontName` varchar(50) DEFAULT NULL,
  `fontTyle` varchar(50) DEFAULT NULL,
  `fontSize` varchar(50) DEFAULT NULL,
  `alpha` varchar(200) DEFAULT NULL,
  `state` int(11) DEFAULT NULL,
  `otherparam` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=51 DEFAULT CHARSET=utf8;

/*Data for the table `xct_module_temp` */

insert  into `xct_module_temp`(`id`,`area_id`,`m_left`,`m_top`,`m_width`,`m_height`,`template_id`,`m_filetype`,`m_other`,`m_text`,`name`,`background`,`foreground`,`span`,`fontName`,`fontTyle`,`fontSize`,`alpha`,`state`,`otherparam`) values (1,1,0,0,640,360,'t.32d4cf20-abcc-4384-84da-5e46e9df0b11','image','',' ','','-16776961','-1','11000','1#2#3#4#5#6#7#8#9#10#11#12#13#14#15#16#21#22','1','20','1.0',0,NULL),(2,1,0,0,555,109,'t.8ee1ab3d-3ff3-4ba7-a47d-ba05088c45e3','scroll','003399#0000ff','滚动播放文字区域~~~~~~','滚动文字2071','-16776961','-16764007','20','宋体','1','40','0.1',1,NULL),(3,1,0,0,640,360,'t.9e481f23-9d2b-4154-8c69-21af14366f64','image','',' ','','-16776961','-1','11000','1#2#3#4#5#6#7#8#9#10#11#12#13#14#15#16#21#22','1','20','1.0',0,NULL),(4,1,0,0,225,400,'t.82a28929-79b4-4409-bcef-1bb1fb01ea52','ppt','',' ','','-16776961','-1','11000','黑体','1','20','1.0',0,NULL),(5,1,0,0,640,360,'t.b13742a6-1b9e-4669-96c3-4098d47d06e7','image','',' ','','-16776961','-1','11000','1#2#3#4#5#6#7#8#9#10#11#12#13#14#15#16#21#22','1','20','1.0',0,NULL),(6,1,0,0,640,360,'t.6e41e9c2-b771-45c9-8a87-38e3c704abb5','image','',' ','','-16776961','-1','11000','1#2#3#4#5#6#7#8#9#10#11#12#13#14#15#16#21#22','1','20','1.0',0,NULL),(7,1,0,0,640,360,'t.fc927ac3-31ab-4d36-a001-691a696ab612','image','',' ','','-16776961','-1','11000','1#2#3#4#5#6#7#8#9#10#11#12#13#14#15#16#21#22','1','20','1.0',0,NULL),(8,1,0,0,225,400,'t.64d460a3-f4f0-429e-8603-93749407334f','image','',' ','','-16776961','-1','11000','1#2#3#4#5#6#7#8#9#10#11#12#13#14#15#16#21#22','1','20','1.0',0,NULL),(9,1,0,0,225,400,'t.62f7b4f1-dfa9-472e-a4bf-f028c4812f63','image','',' ','','-16776961','-1','11000','1#2#3#4#5#6#7#8#9#10#11#12#13#14#15#16#21#22','1','20','1.0',0,NULL),(10,1,0,0,225,400,'t.6058c8d0-5fd6-40f2-969a-230aaf1c157a','','',' ','','-16776961','-1','30000','宋体','1','20','1.0',0,NULL),(11,1,0,0,225,400,'t.21d2e064-d331-4e94-bfae-2effec1e5078','','',' ','','-16776961','-1','30000','宋体','1','20','1.0',0,NULL),(12,1,0,0,225,400,'t.e4042b09-81cc-4f19-9d9e-a49a15e2fe25','','',' ','','-16776961','-1','30000','宋体','1','20','1.0',0,NULL),(13,1,0,0,225,400,'t.9a744715-bca8-4f68-81d0-bae32e7bebf8','image','',' ','','-16776961','-1','11000','1#2#3#4#5#6#7#8#9#10#11#12#13#14#15#16#21#22','1','20','1.0',0,NULL),(14,1,0,0,225,400,'t.d4b1b8a0-fb2b-4c88-9908-1e09291c013c','image','',' ','','-16776961','-1','11000','1#2#3#4#5#6#7#8#9#10#11#12#13#14#15#16#21#22','1','20','1.0',0,NULL),(19,1,0,0,225,400,'t.85fdda5b-4e66-4d8d-9b30-0b6f7302555d','','',' ','','-16776961','-1','30000','宋体','1','20','1.0',0,NULL),(21,1,0,0,225,400,'t.00eaa1a4-75e6-498c-840c-18dc29c6e216','image','',' ','','-16776961','-1','11000','1#2#3#4#5#6#7#8#9#10#11#12#13#14#15#16#21#22','1','20','1.0',0,NULL),(22,1,0,0,225,400,'t.a87f275d-a54e-4079-9c25-8a6bdb18b67d','image','',' ','','-16776961','-1','11000','1#2#3#4#5#6#7#8#9#10#11#12#13#14#15#16#21#22','1','20','1.0',0,NULL),(23,1,0,0,225,400,'t.36948d5f-1967-41ce-a4ff-308bc780b20c','image','',' ','','-16776961','-1','11000','1#2#3#4#5#6#7#8#9#10#11#12#13#14#15#16#21#22','1','20','1.0',0,NULL),(48,1,0,0,560,420,'t.5a936c75-38c3-40cb-a070-8395b243a4b9','video','',' ','','-16776961','-1','11000','黑体','1','20','1.0',0,NULL),(50,1,0,0,560,420,'t.e3018b57-547f-4f0c-8869-683e37f5e22e','image','',' ','','-16776961','-1','11000','1#2#3#4#5#6#7#8#9#10#11#12#13#14#15#16#21#22','1','20','1.0',0,NULL);

/*Table structure for table `xct_online` */

DROP TABLE IF EXISTS `xct_online`;

CREATE TABLE `xct_online` (
  `Session_id` bigint(20) NOT NULL AUTO_INCREMENT,
  `Session_name` varchar(50) DEFAULT NULL,
  `Session_ip` varchar(50) DEFAULT NULL,
  `Session_logintime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `Session_Count` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`Session_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `xct_online` */

/*Table structure for table `xct_sys` */

DROP TABLE IF EXISTS `xct_sys`;

CREATE TABLE `xct_sys` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `empowercode` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `xct_sys` */

/*Table structure for table `xct_template` */

DROP TABLE IF EXISTS `xct_template`;

CREATE TABLE `xct_template` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `template_id` varchar(50) DEFAULT NULL,
  `template_name` varchar(50) DEFAULT NULL,
  `template_type` int(11) DEFAULT NULL,
  `template_width` int(11) DEFAULT NULL,
  `template_height` int(11) DEFAULT NULL,
  `template_expla` varchar(255) DEFAULT NULL,
  `template_background` varchar(200) DEFAULT NULL,
  `template_backmusic` varchar(200) DEFAULT NULL,
  `template_create_name` varchar(50) DEFAULT NULL,
  `create_time` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

/*Data for the table `xct_template` */

insert  into `xct_template`(`id`,`template_id`,`template_name`,`template_type`,`template_width`,`template_height`,`template_expla`,`template_background`,`template_backmusic`,`template_create_name`,`create_time`) values (1,'t.0000002','16:9',3,640,360,'','','','888','2016-11-05 15:31:57'),(2,'t.0000003','9:16',4,225,400,'','','','888','2016-11-05 15:32:13'),(3,'t.0000004','16:9',3,640,360,'','/mediafile/img/201611091446343881847.jpg','','888','2016-11-09 14:50:53'),(4,'t.0000005','4:3',1,560,420,'','','','111','2016-11-09 15:01:33'),(5,'t.0000006','3',1,560,420,'\r\n\r\n\r\nl','','','888','2016-11-11 22:55:44');

/*Table structure for table `xct_template_temp` */

DROP TABLE IF EXISTS `xct_template_temp`;

CREATE TABLE `xct_template_temp` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `template_id` varchar(50) DEFAULT NULL,
  `template_name` varchar(50) DEFAULT NULL,
  `template_type` int(11) DEFAULT NULL,
  `template_width` int(11) DEFAULT NULL,
  `template_height` int(11) DEFAULT NULL,
  `template_expla` varchar(255) DEFAULT NULL,
  `template_background` varchar(200) DEFAULT NULL,
  `template_backmusic` varchar(200) DEFAULT NULL,
  `template_create_name` varchar(50) DEFAULT NULL,
  `create_time` varchar(50) DEFAULT NULL,
  `type` int(11) DEFAULT NULL,
  `parent_template_id` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=73 DEFAULT CHARSET=utf8;

/*Data for the table `xct_template_temp` */

insert  into `xct_template_temp`(`id`,`template_id`,`template_name`,`template_type`,`template_width`,`template_height`,`template_expla`,`template_background`,`template_backmusic`,`template_create_name`,`create_time`,`type`,`parent_template_id`) values (1,'t.8ee1ab3d-3ff3-4ba7-a47d-ba05088c45e3','pic2',1,560,420,'pic','/mediafile/img/20161022145308717911.jpg','','888','2016-10-22 14:57:36',0,'t.0000002'),(2,'t.cc58fb38-6ab2-4131-b595-5173cb9f44aa','222',3,640,360,'','/mediafile/img/201611051529516683140.jpg','','888','2016-11-05 15:32:26',0,'t.0000001'),(3,'t.682ecf3f-2fa7-40c1-b74c-6053aef3376b','222',3,640,360,'','/mediafile/img/201611051529516683140.jpg','','888','2016-11-05 15:37:41',0,'t.0000001'),(4,'t.8c6cf3b3-8020-4645-a631-8bf8f9ccb8b9','222',3,640,360,'','/mediafile/img/201611051529516683140.jpg','','888','2016-11-05 16:06:06',0,'t.0000001'),(5,'t.97cd6a45-273a-4b64-9710-39e629507931','222',3,640,360,'','/mediafile/img/201611051529516683140.jpg','','888','2016-11-05 16:40:01',0,'t.0000001'),(6,'t.075dead0-d202-4ae5-8b8c-1386b8b5ac18','222',3,640,360,'','/mediafile/img/201611051731382529732.jpg','','888','2016-11-05 17:33:03',0,'t.0000004'),(7,'t.71b4b670-e157-464e-aa37-7ecb323912c3','16:9',3,640,360,'','','','888','2016-11-05 18:08:07',0,'t.0000002'),(8,'t.404baa15-6d28-4f3b-a281-cbccba02ee91','16:9',3,640,360,'','','','888','2016-11-05 18:14:50',0,'t.0000002'),(9,'t.47cda16b-a36d-426e-8df2-e4eb448c0ec4','16:9',3,640,360,'','','','888','2016-11-05 18:20:58',0,'t.0000002'),(10,'t.e187f2ba-b2f2-45cc-8058-516cbeb47757','9:16',4,225,400,'','','','888','2016-11-05 18:25:40',0,'t.0000003'),(11,'t.638819e6-e5a9-4bd9-93b5-57fae50980b7','16:9',3,640,360,'','','','888','2016-11-05 18:35:54',0,'t.0000002'),(12,'t.33e72f67-04d3-440c-ae4d-efbd717ea420','16:9',3,640,360,'','','','888','2016-11-05 18:38:16',0,'t.0000002'),(13,'t.b800ff04-72ee-4018-b796-e3b9ae143067','16:9',3,640,360,'','','','888','2016-11-05 18:41:11',0,'t.0000002'),(14,'t.a65e74ad-5c7b-4bce-a811-a06bd5e7db5d','16:9',3,640,360,'','','','888','2016-11-05 18:42:25',0,'t.0000002'),(15,'t.795bb378-1ecd-4e1a-813b-afee96d76f2c','16:9',3,640,360,'','','','888','2016-11-05 18:45:19',0,'t.0000002'),(16,'t.c92e4c55-87f8-401b-b4d5-0a9ce12f6cc1','16:9',3,640,360,'','','','888','2016-11-05 18:46:33',0,'t.0000002'),(17,'t.5e6bffa3-5f01-407c-9297-647d4525e07c','16:9',3,640,360,'','','','888','2016-11-05 18:49:38',0,'t.0000002'),(18,'t.b166ba64-d48f-41f8-8ed7-0000cb19dae6','16:9',3,640,360,'','','','888','2016-11-05 18:51:31',0,'t.0000002'),(19,'t.a975a2df-f134-45cb-b3da-9ac227db89ce','16:9',3,640,360,'','','','888','2016-11-05 19:02:55',0,'t.0000002'),(20,'t.8e28f461-7f13-40be-8949-412aab417817','16:9',3,640,360,'','','','888','2016-11-05 19:11:33',0,'t.0000002'),(21,'t.6bc427a6-81b6-421a-8b52-57c96f346e01','16:9',3,640,360,'','','','888','2016-11-05 19:19:38',0,'t.0000002'),(22,'t.da648358-bd3c-497a-a322-a435a21598c0','16:9',3,640,360,'','','','888','2016-11-05 19:32:43',0,'t.0000002'),(23,'t.d89139ed-b3ec-4205-89c6-285393ab95d2','9:16',4,225,400,'','','','888','2016-11-05 19:41:34',0,'t.0000003'),(24,'t.1505cece-8347-45f5-94f0-afa172e67917','16:9',3,640,360,'','','','888','2016-11-05 19:43:36',0,'t.0000002'),(25,'t.14bc12ac-f3a2-4feb-99c4-92aa9ebbf82a','16:9',3,640,360,'','','','888','2016-11-05 19:46:56',0,'t.0000002'),(26,'t.32d4cf20-abcc-4384-84da-5e46e9df0b11','16:9',3,640,360,'','','','888','2016-11-05 20:06:50',0,'t.0000002'),(27,'t.9e481f23-9d2b-4154-8c69-21af14366f64','16:9',3,640,360,'','','','888','2016-11-05 20:13:42',0,'t.0000002'),(28,'t.82a28929-79b4-4409-bcef-1bb1fb01ea52','9:16',4,225,400,'','','','888','2016-11-07 14:13:35',0,'t.0000003'),(29,'t.b13742a6-1b9e-4669-96c3-4098d47d06e7','16:9',3,640,360,'','','','888','2016-11-07 17:10:13',0,'t.0000002'),(30,'t.6e41e9c2-b771-45c9-8a87-38e3c704abb5','16:9',3,640,360,'','','','888','2016-11-07 17:15:40',0,'t.0000002'),(31,'t.fc927ac3-31ab-4d36-a001-691a696ab612','16:9',3,640,360,'','','','888','2016-11-07 19:43:16',0,'t.0000002'),(32,'t.64d460a3-f4f0-429e-8603-93749407334f','9:16',4,225,400,'','','','888','2016-11-07 20:04:47',0,'t.0000003'),(33,'t.62f7b4f1-dfa9-472e-a4bf-f028c4812f63','9:16',4,225,400,'','','','888','2016-11-07 20:10:30',0,'t.0000003'),(34,'t.6058c8d0-5fd6-40f2-969a-230aaf1c157a','9:16',4,225,400,'','','','888','2016-11-07 20:19:13',0,'t.0000003'),(35,'t.21d2e064-d331-4e94-bfae-2effec1e5078','9:16',4,225,400,'','','','888','2016-11-07 20:21:01',0,'t.0000003'),(36,'t.e4042b09-81cc-4f19-9d9e-a49a15e2fe25','9:16',4,225,400,'','','','888','2016-11-07 20:31:46',0,'t.0000003'),(37,'t.9a744715-bca8-4f68-81d0-bae32e7bebf8','9:16',4,225,400,'','','','888','2016-11-07 20:40:06',0,'t.0000003'),(38,'t.d4b1b8a0-fb2b-4c88-9908-1e09291c013c','9:16',4,225,400,'','','','888','2016-11-07 20:41:28',0,'t.0000003'),(43,'t.85fdda5b-4e66-4d8d-9b30-0b6f7302555d','9:16',4,225,400,'','','','888','2016-11-07 21:02:30',0,'t.0000003'),(45,'t.00eaa1a4-75e6-498c-840c-18dc29c6e216','9:16',4,225,400,'','','','888','2016-11-07 21:58:55',0,'t.0000003'),(46,'t.a87f275d-a54e-4079-9c25-8a6bdb18b67d','9:16',4,225,400,'','','','888','2016-11-07 22:13:52',0,'t.0000003'),(47,'t.36948d5f-1967-41ce-a4ff-308bc780b20c','9:16',4,225,400,'','','','888','2016-11-07 22:18:29',0,'t.0000003'),(70,'t.5a936c75-38c3-40cb-a070-8395b243a4b9','3',1,560,420,'\r\n\r\n\r\nl','','','888','2018-07-28 14:02:14',1,'t.0000006'),(72,'t.e3018b57-547f-4f0c-8869-683e37f5e22e','3',1,560,420,'\r\n\r\n\r\nl','','','888','2018-07-28 16:49:16',1,'t.0000006');

/*Table structure for table `xct_tree` */

DROP TABLE IF EXISTS `xct_tree`;

CREATE TABLE `xct_tree` (
  `tree_id` bigint(20) NOT NULL AUTO_INCREMENT,
  `tree_fid` bigint(20) DEFAULT NULL,
  `tree_name` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`tree_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `xct_tree` */

/*Table structure for table `xct_zu` */

DROP TABLE IF EXISTS `xct_zu`;

CREATE TABLE `xct_zu` (
  `zu_id` bigint(20) NOT NULL AUTO_INCREMENT,
  `zu_pth` bigint(20) DEFAULT NULL,
  `zu_name` varchar(50) DEFAULT NULL,
  `zu_type` int(11) DEFAULT NULL,
  `zu_username` varchar(255) DEFAULT NULL,
  `is_share` int(11) DEFAULT NULL,
  PRIMARY KEY (`zu_id`)
) ENGINE=InnoDB AUTO_INCREMENT=321 DEFAULT CHARSET=utf8;

/*Data for the table `xct_zu` */

insert  into `xct_zu`(`zu_id`,`zu_pth`,`zu_name`,`zu_type`,`zu_username`,`is_share`) values (1,0,'根',99,'888||',NULL),(262,1,'终端组',0,'888||',NULL),(264,1,'节目组',2,'888||',NULL),(265,1,'背景图片',1,'888||',0),(266,1,'图片',1,'888||',0),(267,1,'视频',1,'888||',0),(268,1,'FALSH',1,'888||',0),(269,1,'sys_text',1,'888||',0),(274,1,'ppt',1,'888||',0),(275,1,'flash',1,'999||',0),(278,1,'office',1,'888||',0),(282,1,'sys_text',1,'888',0),(288,1,'EXE',1,'888||',0),(289,1,'音乐',1,'888||',0),(290,1,'PDF',1,'888||',0),(296,262,'测试2',1,'888||',0),(299,264,'测试组',2,'888||',NULL),(301,1,'高清大图',1,'888||',0);

/*Table structure for table `yc_bus` */

DROP TABLE IF EXISTS `yc_bus`;

CREATE TABLE `yc_bus` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `province` varchar(200) DEFAULT NULL,
  `terminus` varchar(200) DEFAULT NULL,
  `bustype` varchar(200) DEFAULT NULL,
  `kilometre` varchar(100) DEFAULT NULL,
  `bushour` varchar(255) DEFAULT NULL,
  `addtime` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=131 DEFAULT CHARSET=utf8;

/*Data for the table `yc_bus` */

insert  into `yc_bus`(`id`,`province`,`terminus`,`bustype`,`kilometre`,`bushour`,`addtime`) values (1,'直辖市','北京','卧铺','1074','13:20　15:00　16:30','2013-08-01 22:32:00'),(2,'直辖市','天津','卧铺','901','9:30　14:40','2013-08-01 22:32:00'),(3,'直辖市','上海','大型高二级','350','6:30　7:30　7:55','2013-08-01 22:32:00'),(4,'直辖市','上海','大型高一级','350','8:30　9:30　10:30　11:30 12:30,13:30　13:55　14:30 15:30 16:50,17:50　18:50','2013-08-01 22:32:00'),(5,'直辖市','松江','中型中级','400','12:35','2013-08-01 22:32:00'),(6,'直辖市','重庆','卧铺','2093','10:30','2013-08-01 22:32:00'),(7,'浙江省','嘉兴','大型高一级','390','6:40 13:10','2013-08-01 22:32:01'),(8,'浙江省','余杭','中型中级','509','5:30','2013-08-01 22:32:01'),(9,'浙江省','湖洲','大型高一级','392','6:30','2013-08-01 22:32:01'),(10,'浙江省','萧山','大型中级','511','6:50','2013-08-01 22:32:01'),(11,'浙江省','平湖','大型高一级','420','6:10 13:45','2013-08-01 22:32:01'),(12,'浙江省','温岭','卧铺','831','15:10','2013-08-01 22:32:01'),(13,'浙江省','杭州','中型高一级','490','8:20 11:30','2013-08-01 22:32:01'),(14,'浙江省','杭州','卧铺','490','17:00 18:30','2013-08-01 22:32:01'),(15,'浙江省','丽水','卧铺','785','11:10','2013-08-01 22:32:01'),(16,'浙江省','金华','卧铺','722','13:40','2013-08-01 22:32:01'),(17,'浙江省','上虞','大型中级','585','10:10','2013-08-01 22:32:01'),(18,'浙江省','余姚','大型中级','648','12:00','2013-08-01 22:32:01'),(19,'浙江省','诸暨','卧铺','577','10:40','2013-08-01 22:32:01'),(20,'浙江省','义乌','卧铺','639','9:00','2013-08-01 22:32:01'),(21,'浙江省','温州','卧铺','919','13:00','2013-08-01 22:32:01'),(22,'浙江省','柳市','卧铺','907','12:20','2013-08-01 22:32:01'),(23,'浙江省','宁波','大型高一级','699','9:40','2013-08-01 22:32:01'),(24,'浙江省','宁波','卧铺','699','16:20','2013-08-01 22:32:01'),(25,'浙江省','嘉善','大型中级','412','8:40','2013-08-01 22:32:01'),(26,'浙江省','富阳','卧铺','524','17:20','2013-08-01 22:32:01'),(27,'浙江省','柯桥','卧铺','537','15:30','2013-08-01 22:32:01'),(28,'浙江省','敖江','卧铺','981','8:50','2013-08-01 22:32:01'),(29,'浙江省','杜桥','卧铺','820','11:40','2013-08-01 22:32:01'),(30,'浙江省','舟山','大型高一级','787','11:00','2013-08-01 22:32:01'),(31,'浙江省','慈溪','卧铺','630','17:40','2013-08-01 22:32:01'),(32,'广东省','东莞','卧铺','2308','9:10','2013-08-01 22:32:01'),(33,'广东省','潮阳','卧铺','1914','6:00','2013-08-01 22:32:01'),(34,'广东省','深圳','卧铺','2098','10:00','2013-08-01 22:32:01'),(35,'广东省','广州','卧铺','1945','10:00','2013-08-01 22:32:01'),(36,'福建省','福州','卧铺','1347','8:00','2013-08-01 22:32:01'),(37,'福建省','石狮','卧铺','1569','8:30','2013-08-01 22:32:01'),(38,'湖北省','襄樊','卧铺','1112','8:25','2013-08-01 22:32:01'),(39,'湖北省','宜昌','卧铺','1233','8:45','2013-08-01 22:32:01'),(40,'湖北省','武汉','卧铺','896','14:50','2013-08-01 22:32:01'),(41,'河南省','许昌','卧铺','890','12:05','2013-08-01 22:32:01'),(42,'河南省','郑州','卧铺','731','15:40','2013-08-01 22:32:01'),(43,'河南省','平顶山','卧铺','785','8:00','2013-08-01 22:32:01'),(44,'陕西省','西安','卧铺','1304','11:05','2013-08-01 22:32:01'),(45,'山西省','太原','卧铺','1277','12:45','2013-08-01 22:32:01'),(46,'山西省','长治','卧铺','870','16:40','2013-08-01 22:32:01'),(47,'黑龙江省','哈尔滨','卧铺','2336','11:40','2013-08-01 22:32:01'),(48,'江西省','南昌','卧铺','969','12:55','2013-08-01 22:32:01'),(49,'江西省','九江','卧铺','785','11:15','2013-08-01 22:32:01'),(50,'云南省','昆明','卧铺','3100','11:50','2013-08-01 22:32:01'),(51,'内蒙古自治区','呼和浩特','卧铺','1652','17:00','2013-08-01 22:32:01'),(52,'山东省','淄博','卧铺','543','7:50','2013-08-01 22:32:01'),(53,'山东省','济南','卧铺','598','15:50','2013-08-01 22:32:01'),(54,'山东省','威海','卧铺','769','9:40','2013-08-01 22:32:01'),(55,'山东省','烟台','卧铺','683','10:40','2013-08-01 22:32:01'),(56,'山东省','青岛','卧铺','503','6:00 7:10','2013-08-01 22:32:01'),(57,'山东省','青岛','卧铺','503','16:00','2013-08-01 22:32:01'),(58,'山东省','枣庄','卧铺','409','7:00','2013-08-01 22:32:01'),(59,'山东省','潍纺','卧铺','500','6:50','2013-08-01 22:32:01'),(60,'山东省','济宁','中型中级','563','6:40','2013-08-01 22:32:01'),(61,'山东省','临沂','中型中级','310','6:30 7:20 8:50 13:30','2013-08-01 22:32:01'),(62,'山东省','临沂','中型中级','310','14:50 16:10','2013-08-01 22:32:01'),(63,'山东省','东营','大型高一级','590','8:20','2013-08-01 22:32:01'),(64,'河北省','石家庄','卧铺','959','11:00','2013-08-01 22:32:01'),(65,'河北省','秦皇岛','卧铺','1153','10:50','2013-08-01 22:32:01'),(66,'河北省','邯郸','卧铺','859','14:30','2013-08-01 22:32:01'),(67,'河北省','保定','卧铺','913','12:20','2013-08-01 22:32:01'),(68,'辽宁省','沈阳','卧铺','1661','14:20','2013-08-01 22:32:01'),(69,'安徽省','合肥','大型高一级','455','6:35 8:05','2013-08-01 22:32:01'),(70,'安徽省','蚌埠','大型高一级','476','6:00','2013-08-01 22:32:01'),(71,'安徽省','宿县','中型中级','382','7:30','2013-08-01 22:32:01'),(72,'安徽省','淮南','中型中级','474','6:35','2013-08-01 22:32:01'),(73,'安徽省','毫州','卧铺','','10:00','2013-08-01 22:32:01'),(74,'安徽省','阜阳','卧铺','535','15:20','2013-08-01 22:32:01'),(75,'安徽省','天长','中型中级','248','12:35','2013-08-01 22:32:01'),(76,'安徽省','马鞍山','大型中级','348','6:05 13:05','2013-08-01 22:32:01'),(77,'安徽省','铜陵','大型中级','552','5:50','2013-08-01 22:32:01'),(78,'安徽省','芜湖','大型中级','393','6:50','2013-08-01 22:32:01'),(79,'安徽省','黄山','大型高一级','642','8:35','2013-08-01 22:32:01'),(80,'安徽省','淮北','中型中级','422','5:50','2013-08-01 22:32:01'),(81,'安徽省','滁州','中型中级','326','13:20','2013-08-01 22:32:01'),(82,'广西省','南宁','卧铺','2400','8:55','2013-08-01 22:32:01'),(83,'湖南省','长沙','卧铺','1406','10:40','2013-08-01 22:32:01'),(84,'湖南省','岳阳','卧铺','1263','9:10','2013-08-01 22:32:01'),(85,'四川省','成都','卧铺','2400','11:30','2013-08-01 22:32:01'),(86,'江苏省','南京','大型高一级','280','6:20 7:00 7:30 8:00 9:00 9:30,10:00 10:30 11:00 12:00 12:30,13:00 13:30 14:00 14:40 15:20,16:00 16:30 17:20 17:50 18:10','2013-08-01 22:32:01'),(87,'江苏省','昆山','中型中级','360','6:05 12:20','2013-08-01 22:32:01'),(88,'江苏省','东海','中型中级','245','7:30 14:50','2013-08-01 22:32:01'),(89,'江苏省','姜堰','中型中级','118','5:40 9:30 12:00 14:00 16:10','2013-08-01 22:32:01'),(90,'江苏省','连云港','中型中级','196','6:20 7:00 8:00 8:30 9:00,10:00 10:50 11:50 12:30 13:00,13:30 14:00 14:20 15:20 16:00,16:50 18:00','2013-08-01 22:32:01'),(91,'江苏省','淮安','中型中级','144','5:50 6:30 7:50 8:30 9:00,10:10 11:30 12:40 14:30 15:30,16:10 17:00','2013-08-01 22:32:01'),(92,'江苏省','南通','中型高一级','205','6:30 7:00 7:30 8:00 9:30,10:30 11:00 11:30 12:00 12:30,13:30 14:30 15:00 15:30 16:30,17:00 17:15 17:30 18:00','2013-08-01 22:32:01'),(93,'江苏省','江都','大型普通级','174','9:10 14:20','2013-08-01 22:32:01'),(94,'江苏省','丹阳','中型中级','294','7:15 13:20','2013-08-01 22:32:01'),(95,'江苏省','丹阳','大型普通级','294','8:00','2013-08-01 22:32:01'),(96,'江苏省','镇江','中型中级','222','6:30 8:00 8:40 9:30 12:50,13:40 14:40','2013-08-01 22:32:01'),(97,'江苏省','扬中','中型中级','215','7:50 12:50 13:50','2013-08-01 22:32:01'),(98,'江苏省','句容','中型中级','266','6:40 12:20','2013-08-01 22:32:01'),(99,'江苏省','宜兴','中型中级','317','5:40 6:20 7:40 12:10 13:15,14:35','2013-08-01 22:32:01'),(100,'江苏省','高港','中型中级','209','10:50 17:40','2013-08-01 22:32:01'),(101,'江苏省','徐州','中型中级','360','5:30 6:00 6:25 7:20 8:10 9:10,10:40 11:20 12:50 14:20 15:20,16:20 18:00','2013-08-01 22:32:01'),(102,'江苏省','泰州','中型中级','134','6:15 7:00 8:10 9:00 9:20,10:10 11:40 12:40 13:40 14:40,15:30 16:00 17:10','2013-08-01 22:32:01'),(103,'江苏省','海安','中型中级','119','6:45 9:45 13:15','2013-08-01 22:32:01'),(104,'江苏省','新沂','中型中级','252','8:20','2013-08-01 22:32:01'),(105,'江苏省','扬州','中型中级','194','5:50 6:30 6:50 7:20 8:20 9:10,10:30 11:30 12:00 12:20 13:10,14:00 15:00 16:00 17:00','2013-08-01 22:32:01'),(106,'江苏省','高邮','中型中级','130','8:05 13:30','2013-08-01 22:32:01'),(107,'江苏省','兴化','中型中级','79','6:50 7:55 8:50 9:50 11:10,12:30 13:05 14:25 15:40 16:40','2013-08-01 22:32:01'),(108,'江苏省','靖江','中型中级','206','7:25 8:10 12:50 15:10','2013-08-01 22:32:01'),(109,'江苏省','戴南','中型中级','100','9:20 13:40 15:05','2013-08-01 22:32:01'),(110,'江苏省','金沙','中型中级','231','7:45 12:10','2013-08-01 22:32:01'),(111,'江苏省','如东','中型中级','204','8:45 12:40','2013-08-01 22:32:01'),(112,'江苏省','启东','中型中级','299','6:15 11:15 12:20','2013-08-01 22:32:01'),(113,'江苏省','海门','中型中级','245','6:00 12:50','2013-08-01 22:32:01'),(114,'江苏省','泰兴','中型中级','202','7:10 11:20 12:10 12:55','2013-08-01 22:32:01'),(115,'江苏省','无锡','中型高一级','258','7:40 8:40 10:00 11:30 12:30,13:30 14:30 15:30','2013-08-01 22:32:01'),(116,'江苏省','如皋','大型中级','139','7:15 13:40 14:15','2013-08-01 22:32:01'),(117,'江苏省','楚州','中型中级','126','11:50','2013-08-01 22:32:01'),(118,'江苏省','涟水','中型中级','113','8:00 13:00','2013-08-01 22:32:01'),(119,'江苏省','宝应','中型中级','114','6:20 7:40 9:40 10:40 13:10,14:50 15:50 17:10','2013-08-01 22:32:01'),(120,'江苏省','宿迁','中型中级','240','7:30 8:40 13:20 13:50','2013-08-01 22:32:01'),(121,'江苏省','苏州','中型中级','327','7:00 8:00 9:00 10:30 12:00,13:00 14:00 15:00 16:00','2013-08-01 22:32:01'),(122,'江苏省','常熟','中型中级','295','7:20 14:00','2013-08-01 22:32:01'),(123,'江苏省','江阴','中型中级','217','6:45 13:30','2013-08-01 22:32:01'),(124,'江苏省','张家港','中型中级','250','6:40 13:30','2013-08-01 22:32:01'),(125,'江苏省','溧阳','中型中级','351','7:45','2013-08-01 22:32:01'),(126,'江苏省','太仓','中型中级','342','8:30 13:20','2013-08-01 22:32:01'),(127,'江苏省','湖塘','中型中级','280','13:40','2013-08-01 22:32:01'),(128,'江苏省','沭阳','中型中级','200','7:10 7:45 12:50','2013-08-01 22:32:01'),(129,'江苏省','金湖','中型中级','201','5:50 8:50 12:25','2013-08-01 22:32:01'),(130,'江苏省','常州','中型中级','269','5:50 7:00 9:00 10:00 11:20,13:00 14:20 15:40 16:50 17:30','2013-08-01 22:32:01');

/*Table structure for table `yc_plane` */

DROP TABLE IF EXISTS `yc_plane`;

CREATE TABLE `yc_plane` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `airline` varchar(255) DEFAULT NULL,
  `flight` varchar(200) DEFAULT NULL,
  `planetype` varchar(200) DEFAULT NULL,
  `planecycle` varchar(255) DEFAULT NULL,
  `flightstarttime` varchar(200) DEFAULT NULL,
  `flightendtime` varchar(50) DEFAULT NULL,
  `inorout` int(11) DEFAULT NULL,
  `addtime` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=24 DEFAULT CHARSET=utf8;

/*Data for the table `yc_plane` */

insert  into `yc_plane`(`id`,`airline`,`flight`,`planetype`,`planecycle`,`flightstarttime`,`flightendtime`,`inorout`,`addtime`) values (1,'北京-盐城','CA1245','B737','每日','19:45','21:10',1,'2013-08-01 22:32:00'),(2,'昆明-盐城','MU5749','B737','每日','14:30','18:45',1,'2013-08-01 22:32:00'),(3,'长沙-盐城','MU5749','B737','每日','17:20','18:45',1,'2013-08-01 22:32:00'),(4,'首尔-盐城','OZ3495','A321','2.5','11:00(首尔时间)','11:45',1,'2013-08-01 22:32:00'),(5,'首尔-盐城','MU218','A320','4.7','12:15(首尔时间)','12:50',1,'2013-08-01 22:32:00'),(6,'台北—盐城','MU2972','A320','1.6','11:15','13:00',1,'2013-08-01 22:32:00'),(7,'台北—盐城','AE951','A320','4.7','14:10','16:25',1,'2013-08-01 22:32:00'),(8,'台北-盐城','B7130','MD90','周二','14:40','16:55',1,'2013-08-01 22:32:00'),(9,'香港-盐城','MU2071','A320','2、6','11:20','13:30',1,'2013-08-01 22:32:00'),(10,'广州-盐城','CZ3267','B737','每日','15:40','18:05',1,'2013-08-01 22:32:00'),(11,'北京-盐城','CA1591','B737','每日','12:30','14:20',1,'2013-08-01 22:32:00'),(12,'盐城-北京','CA1246','B737','每日','22:00','23:45',2,'2013-08-01 22:32:01'),(13,'盐城-长沙','MU5750','B737','每日','20:05','22:05',2,'2013-08-01 22:32:01'),(14,'盐城-昆明','MU5750','B737','每日','20:05','01:00',2,'2013-08-01 22:32:01'),(15,'盐城-首尔','OZ3505','A321','2.5','12:45','15:15（首尔时间）',2,'2013-08-01 22:32:01'),(16,'盐城-首尔','MU217','A320','4.7','13:35','16:00(首尔时间)',2,'2013-08-01 22:32:01'),(17,'盐城—台北','MU2971','A320','1.6','13:40','15:55',2,'2013-08-01 22:32:01'),(18,'盐城—台北','AE952','A320','4.7','17:25','19:45',2,'2013-08-01 22:32:01'),(19,'盐城-台北','B7129','MD90','周二','17:55','20:10',2,'2013-08-01 22:32:01'),(20,'盐城-香港','MU2072','A320','2、6','14:10','16:45',2,'2013-08-01 22:32:01'),(21,'盐城-南通','CZ3267','B737','每日','18:55','19:35',2,'2013-08-01 22:32:01'),(22,'盐城-广州','CZ3267','B737','每日','18:55','22:25',2,'2013-08-01 22:32:01'),(23,'盐城-北京','CA1592','B737','每日','15:20','17:05',2,'2013-08-01 22:32:01');

/*Table structure for table `yc_train` */

DROP TABLE IF EXISTS `yc_train`;

CREATE TABLE `yc_train` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `chenumber` varchar(100) DEFAULT NULL,
  `shifazhang` varchar(100) DEFAULT NULL,
  `zhongdianzhan` varchar(100) DEFAULT NULL,
  `cheliangtype` varchar(100) DEFAULT NULL,
  `fazhan` varchar(255) DEFAULT NULL,
  `fashi` varchar(100) DEFAULT NULL,
  `daozhan` varchar(100) DEFAULT NULL,
  `daoshi` varchar(100) DEFAULT NULL,
  `tingzhan` varchar(100) DEFAULT NULL,
  `lishi` varchar(100) DEFAULT NULL,
  `yingzuo` varchar(100) DEFAULT NULL,
  `ruanzuo` varchar(100) DEFAULT NULL,
  `yingwozhong` varchar(100) DEFAULT NULL,
  `ruanwoxia` varchar(100) DEFAULT NULL,
  `addtime` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8;

/*Data for the table `yc_train` */

insert  into `yc_train`(`id`,`chenumber`,`shifazhang`,`zhongdianzhan`,`cheliangtype`,`fazhan`,`fashi`,`daozhan`,`daoshi`,`tingzhan`,`lishi`,`yingzuo`,`ruanzuo`,`yingwozhong`,`ruanwoxia`,`addtime`) values (1,'K246/K247','成都','扬州','空调快速','盐城','03:59','扬州','06:30','24','02:31','38','-','84/89/92','126/132','2013-08-01 22:32:00'),(2,'T215','北京','泰州','空调特快','盐城','07:19','泰州','08:59','9','01:40','24','-','70/75/78','106/112','2013-08-01 22:32:00'),(3,'K8575/K8578','盐城','南京','空调快速','盐城','07:35','南京','11:44','6','04:09','51','78','-','-','2013-08-01 22:32:00'),(4,'Z51','北京','南通','空调特快','盐城','07:54','南通','09:55','5','02:01','-','-','-','109/115','2013-08-01 22:32:00'),(5,'K566/K563','太原','南通','空调快速','盐城','08:09','南通','10:45','13','02:36','25','-','71/76/79','109/115','2013-08-01 22:32:00'),(6,'T158/T155','哈尔滨','泰州','空调特快','盐城','08:24','泰州','10:11','10','01:47','24','-','70/75/78','106/112','2013-08-01 22:32:00'),(7,'K772','南通','济南','空调快速','盐城','09:31','济南','19:21','15','09:50','92','142','159/165/170','-','2013-08-01 22:32:00'),(8,'K8505','淮安','南通','空调快速','盐城','10:10','南通','12:55','8','02:45','-','40','-','-','2013-08-01 22:32:00'),(9,'K420/K417','兰州','泰州','空调快速','盐城','11:15','泰州','13:09','23','01:54','24','-','70/75/78','106/112','2013-08-01 22:32:00'),(10,'K8600','南通','淮安','快速','盐城','11:20','淮安','13:15','8','01:55','11','-','-','-','2013-08-01 22:32:00'),(11,'K415/K414','扬州','青岛','空调快速','盐城','12:50','青岛','21:37','17','08:47','87','-','153/157/162','234/245','2013-08-01 22:32:00'),(12,'K8576/K8577','南京','盐城','空调快速','南京','13:58','盐城','18:38','6','04:40','51','78','-','-','2013-08-01 22:32:00'),(13,'K245/K248','扬州','成都','空调快速','盐城','14:11','成都','22:15','22','32:04','231','-','391/405/418','615/642','2013-08-01 22:32:00'),(14,'K564/K565','南通','太原','空调快速','盐城','15:10','太原','06:40','14','15:30','154','-','263/272/281','411/429','2013-08-01 22:32:00'),(15,'K8506','南通','淮安','空调快速','盐城','16:10','淮安','18:38','8','02:28','-','31','-','-','2013-08-01 22:32:00'),(16,'K8599','淮安','南通','快速','盐城','16:49','南通','19:55','8','03:06','15','-','-','-','2013-08-01 22:32:00'),(17,'K771','济南','南通','空调快速','盐城','17:04','南通','20:20','13','03:16','25','40','71/76/79','-','2013-08-01 22:32:00'),(18,'K416/K413','青岛','扬州','空调快速','盐城','17:41','扬州','21:40','17','03:59','38','-','84/89/92','126/132','2013-08-01 22:32:00'),(19,'K419/K418','泰州','兰州','空调快速','盐城','18:28','兰州','18:36','21','24:08','215','-','365/377/390','574/600','2013-08-01 22:32:00'),(20,'T157/T156','泰州','哈尔滨','空调特快','盐城','19:14','哈尔滨','17:28','10','22:14','257','-','437/452/467','690/720','2013-08-01 22:32:00'),(21,'Z52','南通','北京','空调特快','盐城','20:50','北京','07:28','5','10:38','-','-','-','400/417','2013-08-01 22:32:00'),(22,'T217/T216','泰州','北京','空调特快','盐城','21:55','北京','09:43','9','11:48','150','-','256/265/274','400/417','2013-08-01 22:32:00');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
